[
    {
        "track": "dev",
        "title":"Foobar 1",
        "speaker":"Jerry Nixon",
        "description":"Bar baz 1",
        "startTime":"2017-05-23T15:30:00Z",
        "endTime":"2017-05-23T16:30:00Z",
        "room":"Alpha 1",
        "tags":"ab,vs"
    },
    {
        "track": "dev",
        "title":"Foobar 2",
        "speaker":"Jerry Nixon",
        "description":"Bar baz 2",
        "startTime":"2017-05-23T16:45:00Z",
        "endTime":"2017-05-23T17:45:00Z",
        "room":"Alpha 1",
        "tags":"ab,vs"
    },
    {
        "track": "dev",
        "title":"Foobar 3",
        "speaker":"Jerry Nixon",
        "description":"Bar baz 3",
        "startTime":"2017-05-22T18:00:00Z",
        "endTime":"2017-05-22T19:00:00Z",
        "room":"Alpha 1",
        "tags":"ab,vs"
    },
    {
        "track": "dev",
        "title":"Upgrade your Enterprise UI - A practical introduction to XAML",
        "speaker":"Jerry Nixon",
        "description":"XAML is both the past and the future of user interfaces on the Microsoft platform. Born in 2006 with Windows Presentation Foundation, XAML became the declarative UI of choice for thousands of enterprises and line of business applications. From Silverlight to Windows Phone, XAML has graduated to UWP-XAML, the foundational platform for modern apps, Microsoft Office, and the Windows operating system itself. The future is bright for XAML, perhaps it’s time you see what it’s all about.",
        "startTime":"2017-05-22T15:30:00Z",
        "endTime":"2017-05-22T16:30:00Z",
        "room":"PELICAN 1",
        "tags":"ab,vs"
    },
    {
        "track": "it",
        "title":"Software Project Design",
        "speaker":"Juval Lowy",
        "description":"Much as the need to design the system, you must also design the project: from scheduling resources behind the services, the staffing distribution, examining the planned progress and even to validating your plan, and accommodating changes. This requires understanding the inner dependencies between services and activities, the critical path of integration, the available floats, and the risks involved. All of these challenges stem from your design and addressing them properly is a hard core engineering task – designing the project. In this intense session Juval Lowy shares his approach software project design, along with his unique insight for delivering software on schedule and budget. You will also see to deal with common misconceptions and typical roles and responsibilities in the team.",
        "startTime":"2017-05-22T15:30:00Z",
        "endTime":"2017-05-22T16:30:00Z",
        "room":"OSPREY",
        "tags":"vs"
    },
    {
        "track": "sql",
        "title":"Introduction to Performance Troubleshooting Using Wait Statistics",
        "speaker":"Paul S. Randal",
        "description":"TO BE DONE",
        "startTime":"2017-05-22T15:30:00Z",
        "endTime":"2017-05-22T16:30:00Z",
        "room":"SWAN 4",
        "tags":"sql"
    }
]
