[

    {
        "speakers":  "Don Jones, Jeffrey Snover",
        "track":  "it",
        "title":  "Azure Stack - It\u0027s More Radical Than You Think",
        "description":  "",
        "id":  "azurestackitsmoreradicalthanyouthink",
        "endTime":  "2017-05-22T13:45:00Z",
        "room":  "Swan Ballroom",
        "startTime":  "2017-05-22T12:30:00Z"
    },
    {
        "speakers":  "Dan Wahlin, John Papa",
        "track":  "dev",
        "title":  "Angular In 60-Ish Minutes",
        "description":  "Dive into Angular 2 with Google GDEs Dan Wahlin and John Papa and learn the key concepts that you need to know to get started building robust Single Page Applications. In this session you\u0027ll learn about core Angular modules, see how they can be imported using TypeScript, learn about data binding, components, services, routing and more.",
        "id":  "angularinishminutes",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Scot Hillier",
        "track":  "it",
        "title":  "Building Applications For Office 365 And Sharepoint With Reactjs",
        "description":  "ReactJS is a JavaScript framework for building user interfaces. This popular framework is at the heart of the new SharePoint Framework (SPFX). In this session, ReactJS and TypeScript will be used to build client-side web parts for Office 365 and SharePoint; both on-premises and in the cloud. Attendees will exit the session with new ideas for building client-side web parts for Office 365 and SharePoint.",
        "id":  "buildingapplicationsforofficeandsharepointwithreactjs",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "John Savill",
        "track":  "it",
        "title":  "Containers – What They Mean For The It Pro",
        "description":  "IT Pros are used to virtual machines and they are often seen as the solution to any problem. Need isolation, create a VM. Need resource control, create a VM but there are many things VMs don’t help with and such as prescriptive deployment and actually slow down deployments. Containers are a new technology and a type of virtualization that solves a huge number of challenges with application deployment and lifecycle management. In this session John will walk through what containers are, what is Docker, how to create containers and the role they play in your organization.",
        "id":  "containerswhattheymeanfortheitpro",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Scott Hunter",
        "track":  "dev",
        "title":  "Faster, Smaller, Better - Visual Studio 2017",
        "description":  "Visual Studio 2017 is now available for developers, and it is packed with new features to help you. From improved web tools and new unit testing capabilities, to improved profiling and language features, Scott will show you all of the cool features that make developing with Visual Studio an amazing experience. You’ll learn tips and tricks that will help improve your applications immediately.",
        "id":  "fastersmallerbettervisualstudio",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Dan Usher, Scott Hoag",
        "track":  "it",
        "title":  "Getting Your Company Up And Running With Office 365",
        "description":  "Whether you\u0027re thinking about purchasing Office 365 for your business or you\u0027ve inherited an Office 365 tenant, there\u0027s a strategy to getting on-boarded to both the suite of cloud services and the desktop components of Office 365. In this session, we\u0027ll start with a fresh tenant and show you how to get up and running the right way no fuss. By the end of this session, we\u0027ll have configured a tenant with: \n\n• DNS setup for major suite components (Exchange Online, Skype for Business, MDM)\n• Configured identity synchronization with a verified domain\n• Deployed a custom Office 2016 ProPlus installer and review deployment options\n• Configured the tenant to allow users access to Outlook Groups, Microsoft Teams, and SharePoint Online",
        "id":  "gettingyourcompanyupandrunningwithoffice",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Tim Radney",
        "track":  "sql",
        "title":  "Introduction To High Availability And Disaster Recovery With Sql Server",
        "description":  "Are you looking to build a High Availability (HA) and/or Disaster Recovery (DR) strategy for your SQL Server environment? If so, you may be struggling to understand what an HA/DR plan should look like and what options are available to you natively within SQL Server. In this session, Tim will go over the fundamentals of HA and DR technologies built into SQL Server such as Database Mirroring, Log Shipping, Replication, Availability Groups as well as the benefits of Failover Clustering. After attending this session, you will have a better understanding of when to use each HA/DR feature, which version of SQL Server supports which feature, as well as the pros and cons of each.",
        "id":  "introductiontohighavailabilityanddisasterrecoverywithsqlserver",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Paul Randal",
        "track":  "sql",
        "title":  "Introduction To Performance Troubleshooting Using Wait Statistics",
        "description":  "One of the first things you should check when investigating performance issues are wait statistics - as these can often point you in the direction for further analysis. Unfortunately, many people misinterpret what SQL Server is telling them and jump to conclusions about how to solve the problem - what is often called \u0027knee-jerk performance tuning\u0027. In this session, you will learn what waits are, how to analyze them, and potential solutions to common problem patterns.",
        "id":  "introductiontoperformancetroubleshootingusingwaitstatistics",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Ben Miller",
        "track":  "sql",
        "title":  "Practical Powershell For Sql Server",
        "description":  "This session will cover real world functions that are used for real interaction with SQL Server. There will be a few slides but mostly demos with actual scripts that interact with SQL Server for management and getting data in and out. I will also introduce some outside modules created to assist as well. Things like Reading/Changing the following: Permissions, DB Owner maintenance and database space management. We all could use a few standard things in the SQL Server world of ever changing roles and “I have to have it now” stuff, that Management Studio can get in the way of getting it done faster. Join me for a fun PowerShell hour and never try to reuse a click again.",
        "id":  "practicalpowershellforsqlserver",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Brock Allen",
        "track":  "dev",
        "title":  "Securing Web Apis From Javascript/Spa Applications",
        "description":  "Modern web development means that more and more application code is running in the browser as JavaScript. This architectural shift requires us to change how we perform authentication and authorization. Fortunately, using modern protocols such as OpenID Connect you don’t need to invent your own solution for this new environment. This session will show you the modern approach for browser-based JavaScript applications to authenticate users, and perform secure web api invocations. As you might expect, security is sufficiently complex and so even modern security comes with its own set of challenges. Luckily, we will show off some libraries that help manage this complexity so your application doesn’t have to.",
        "id":  "securingwebapisfromjavascriptspaapplications",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Juval Lowy",
        "track":  "dev",
        "title":  "Software Project Design",
        "description":  "Much as the need to design the system, you must also design the project: from scheduling resources behind the services, the staffing distribution, examining the planned progress and even to validating your plan, and accommodating changes. This requires understanding the inner dependencies between services and activities, the critical path of integration, the available floats, and the risks involved. All of these challenges stem from your design and addressing them properly is a hard core engineering task – designing the project. In this intense session Juval Lowy shares his approach software project design, along with his unique insight for delivering software on schedule and budget. You will also see to deal with common misconceptions and typical roles and responsibilities in the team.",
        "id":  "softwareprojectdesign",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "David Pless",
        "track":  "sql",
        "title":  "Sql Server 2016: All Up Security Features",
        "description":  "In this session we will be cover and demo many security features such as Row Level Security, Dynamic Data Masking, Always Encrypted, Advanced Threat Detection, and the Azure Security Center covering SQL Server 2016 and Azure SQL Database. \n\nRow-Level Security enables customers to control access to rows based on the characteristics of the user executing a query. RLS enables you to implement restrictions on data row access. For example ensuring that workers can access only those data rows that are pertinent to their department, or restricting a customer\u0027s data access to only the data relevant to their company. Dynamic Data Masking limits (DDM) sensitive data exposure by masking it to non-privileged users. It can be used to greatly simplify the design and coding of security in your application. Always Encrypted is another feature designed to protect sensitive data stored in Azure SQL Database or SQL Server databases. Always Encrypted allows clients to encrypt sensitive data inside client applications and never reveal the encryption keys to the Database Engine (Azure SQL Database or SQL Server). These technologies can be used together to create a defense in depth strategy. We will cover these security features with an in-depth, demo focused delivery covering Azure SQL Database and SQL Server 2016 on-prem. \n\nWe will also cover the Azure Security Center and Advanced Threat Detection which can be used to provide a dashboard for viewing and responding to security risks with a fully Power BI integrated solution. Azure SQL Database Threat Detection provides security by detecting activities which may indicate a threat such as SQL injection attacks. The benefits of Azure Threat Detection include configuration of SQL threat detection policy, email alerts upon detection, and Azure Portal and Microsoft Excel integration.",
        "id":  "sqlserverallupsecurityfeatures",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Jerry Nixon",
        "track":  "dev",
        "title":  "Upgrade Your Enterprise Ui - A Practical Introduction To Xaml",
        "description":  "XAML is both the past and the future of user interfaces on the Microsoft platform. Born in 2006 with Windows Presentation Foundation, XAML became the declarative UI of choice for thousands of enterprises and line of business applications. From Silverlight to Windows Phone, XAML has graduated to UWP-XAML, the foundational platform for modern apps, Microsoft Office, and the Windows operating system itself. The future is bright for XAML, perhaps it’s time you see what it’s all about.",
        "id":  "upgradeyourenterpriseuiapracticalintroductiontoxaml",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Don Jones",
        "track":  "it",
        "title":  "What A Functioning Devops Team Looks Like - And How To Get There",
        "description":  "DevOps, DevOps, DevOps. We all hear about it, and those \"in the know\" realize that it\u0027s mainly an organizational and cujltural change. So what\u0027s that actually look like? What does a real-live, functioning \"DevOps team\" do all day, and how are they organized? What are the cultural barriers to getting there, and how can you start conquering them? Don Jones, CEO of The DevOps Collective, Inc., walks you through real-world examples, cse studies, and more in this concise, discussion-based session.",
        "id":  "whatafunctioningdevopsteamlookslikeandhowtogetthere",
        "endTime":  "2017-05-22T15:30:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-22T14:30:00Z"
    },
    {
        "speakers":  "Tim Warner",
        "track":  "it",
        "title":  "\"Round Trip\" Desired State Configuration",
        "description":  "The pain point: You\u0027ve pushed a few PowerShell DSC configurations, and you have a basic familiarity with DSC workflow. However, you now need an end-to-end understanding of how DSC works to support your business\u0027 DevOps initiative. \n\nThe solution: In this session we\u0027ll use a case study approach to learn the complete DSC development, implementation, and maintenance lifecycle. \n\nHere are some of the things you\u0027ll know how to do after attending this presentation:\n• build a DSC resource\n• include the new resource in a DSC configuration\n• push the configuration to a node and perform troubleshooting\n• install the resource and configuration on an Azure Automation DSC pull server\n• on-board an Azure VM node and verify operations\n\nTim set up a permanent session page and GitHub repository for this presentation, so you\u0027ll be able to recreate all examples and review all session materials at your leisure.",
        "id":  "roundtripdesiredstateconfiguration",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Javier Lozano",
        "track":  "dev",
        "title":  "Adding Realtime Features To Your Applications With Signalr",
        "description":  "Ever wondered how hard is to add real time eventing to your ASP.NET application? SignalR is a new library that makes bi-directional communication easy and fun. In this session we\u0027ll cover the features and approaches SignalR offers on both client and server sides. If you\u0027re interesting in adding real time eventing to your applications today, you don\u0027t want to miss this talk.",
        "id":  "addingrealtimefeaturestoyourapplicationswithsignalr",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Rob Windsor",
        "track":  "it",
        "title":  "An Introduction To Development With The Sharepoint Framework (Spfx)",
        "description":  "At the “Future of SharePoint” event in May, Microsoft announced a new page and web part model called the SharePoint Framework (SPFx). Microsoft used this new framework to build the Modern list and library user experiences that have been rolling out to SharePoint Online. As you’ll see in the session, developing for the SharePoint Framework using the developer preview is nothing like “traditional” SharePoint development. There’s no File | New Project in Visual Studio; instead we’ll be using tools like Node, Yeoman, Gulp and TypeScript. We’re not in Kansas anymore Toto.",
        "id":  "anintroductiontodevelopmentwiththesharepointframeworkspfx",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "John Papa",
        "track":  "dev",
        "title":  "Angular Cli",
        "description":  "Learn how to be highly productive developing Angular applications. We\u0027ll spark the CLI as we awaken an app from scratch. We\u0027ll add various features using the CLI, take advantage of template autocomplete, and strategically use code snippets on our way to building an app. Learn how to fly at light speed and with confidence while coding Angular.",
        "id":  "angularcli",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "James Montemagno",
        "track":  "dev",
        "title":  "Go Mobile With Visual Studio, C#, And Xamarin",
        "description":  "Xamarin enables C# developers to become native iOS, Android, and Windows mobile app developers overnight. In this session, you will learn how to leverage your existing .NET and C# skills to create iOS and Android mobile apps in Visual Studio with Xamarin. In addition to allowing you write your iOS and Android apps in C#, Xamarin lets you reuse existing .NET libraries and share your business logic across iOS, Android, and Windows apps. This session will also give you the tools to determine how much existing C# code can go mobile to iOS and Android, plus help you determine the architecture necessary to support maximum code sharing and reuse. We will also provide guidance and best practices for handling fragmentation across and within each device platform. During this session we will cover the Xamarin platform and how to create native iOS, Android, and Windows apps in C#. Moreover, we will really focus on the code with several live coding adventures throughout the entire session. When you leave you will have the knowledge to create your first iOS \u0026 Android in C# with Xamarin in Visual Studio.",
        "id":  "gomobilewithvisualstudiocandxamarin",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Adam Tuliper",
        "track":  "dev",
        "title":  "Hack Proofing Your Modern Web Applications",
        "description":  "Secure your modern Web apps now. Developers are notoriously lax with including security in their applications. In an age of hacking, this talk aims to arm the developer with an arsenal of protections to use while developing. This presentation explores the most common attacks on Web applications, how they work to exploit your app, and most importantly, how to protect against them.",
        "id":  "hackproofingyourmodernwebapplications",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Aaron Bertrand",
        "track":  "sql",
        "title":  "New T-Sql Capabilities In Sql Server 2016 \u0026 V.Next",
        "description":  "Discover the ins and outs of some of the newest capabilities of our favorite data language. From JSON to SESSION_CONTEXT, to new query hints like USE HINT, to helper functions like STRING_AGG and STRING_SPLIT, and – finally – CREATE OR ALTER, this session will be packed with demos, and you’ll walk away with a long list of reasons to consider upgrading to the latest version – or the next version.",
        "id":  "newtsqlcapabilitiesinsqlservervnext",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Michele Bustamante",
        "track":  "dev",
        "title":  "Scaling Containers Solutions With Azure Container Service And Mesosphere Dc/Os",
        "description":  "Azure Container Service makes it easy to provision a container-based solution in Azure - based on Mesosphere DC/OS. While Azure provides you with the infrastructure management, automation and visibility into those assets - DC/OS provides a solid platform for container orchestration, monitoring, scale and self-healing. This session will show you how to set up a cluster, deploy your first containerized application to DC/OS, configure load balancing at multiple service tiers, and show you how to setup self-healing and scale. You\u0027ll get a kick start toward configuring your container and Docker applications for scale and operational success - including the aspects of Azure that contribute at the infrastructure level.",
        "id":  "scalingcontainerssolutionswithazurecontainerserviceandmesospheredcos",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Brian Noyes",
        "track":  "dev",
        "title":  "Securing Web Apis From Mobile And Native Applications",
        "description":  "Mobile devices and applications are becoming the prominent mechanism for users to operate digitally. Developing for these platforms is new for many developers and how to build secure applications for these environments is crucial. Fortunately, inventing your own security is not necessary (or recommended) and instead you can rely upon the OpenID Connect protocol. This session shows how to use this protocol to authenticate your users, as well as gain secure access to the backend APIs that support your applications. In addition to these basics, we will discuss more advanced security features of the protocols including PKCE and PoP.",
        "id":  "securingwebapisfrommobileandnativeapplications",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Ben Miller",
        "track":  "sql",
        "title":  "Smo: A Study Of The Server Management Objects",
        "description":  "SMO, short for Shared Management Objects (or SQL Management Objects to some), are some powerful programming interfaces to get and manipulate SQL Server in code. These objects are used in custom programs, in scripting with PowerShell and can be used to fully manage a SQL Server. But what do you really do with them? How do you use them? This session will cover some core objects that are used in every day interaction with SQL Server. I will cover how to get access to them, how to use them and best of all you will get to know these mysterious objects",
        "id":  "smoastudyoftheservermanagementobjects",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Jonathan Kehayias",
        "track":  "sql",
        "title":  "Sql Server Performance Tuning: Eliminating Low Hanging Fruit",
        "description":  "You know they are there, those small issues that affect performance and are easy to fix, but finding them can be a challenge. This session will show you how to find the low hanging fruit in your environment, explain why the problem exists, and step through how you can make the necessary changes to boost your SQL Server’s performance with a minimal amount of effort. Jonathan will show you how to find common schema and code design problems that help you get the most bang for your buck when performance tuning SQL Server. By focusing on real-world examples with reproducible workloads, you will easily be able to see the impact of common problems and learn how to fix them quickly for improved performance from the least amount of effort.",
        "id":  "sqlserverperformancetuningeliminatinglowhangingfruit",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Gina Montgomery",
        "track":  "it",
        "title":  "The Ultimate Guide To Office 365 Collaboration",
        "description":  "Today\u0027s workplace has evolved. Employees are working on more teams than ever. Teams are comprised of internal and external users, spread across different geographies and now have an ever wider multigenerational composition than before. These teams all still have to find a way to collaborate, have different needs and are facing a common set of challenges. In this session we will cover Office 365 Collaboration Use Case guidance across Teams, Skype, Office, SharePoint and Yammer, as well as, the intelligent fabric that ties them all together. You\u0027ll learn how to create a productive, digital workspace for your all of your end users that will inspire the team collaboration that is needed while eliminating the confusion on what to use for what.",
        "id":  "theultimateguidetoofficecollaboration",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "John Savill",
        "track":  "it",
        "title":  "Understanding Arm With A Whiteboard And An Rdp Session",
        "description":  "In this session John will explore the key aspects of Azure infrastructure services including compute, storage and networking without a single powerpoint slide (well maybe one). Instead John will walk through key aspects using a whiteboard, a web browser and an RDP session. By the end of this session the attendees will have a solid understanding of the Azure infrastructure services and how to leverage them in conjunction with on-premises infrastructure.",
        "id":  "understandingarmwithawhiteboardandanrdpsession",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Tim Radney",
        "track":  "sql",
        "title":  "Understanding Sql Server Backup And Restore",
        "description":  "Everyone knows that it\u0027s critical to have backups but it\u0027s amazing how few people make sure those backups can be restored properly! Too many times to count, Tim has been brought in by organizations to help recover failed systems where administrators simply didn’t know how to properly restore SQL Server backups when they have to. In this session, Tim will explain the various types of backups that can be taken and demonstrate how to restore each of them. Apart from covering the common full, differential and log backups, Tim will also cover partial, filegroup, and COPY_ONLY backups, backing up to and restoring from a URL, backup encryption, and how to perform a hack attach for the ultimate tail log restore. There\u0027s something here for everyone to learn!",
        "id":  "understandingsqlserverbackupandrestore",
        "endTime":  "2017-05-22T16:45:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-22T15:45:00Z"
    },
    {
        "speakers":  "Scott Hunter",
        "track":  "dev",
        "title":  ".Net For Developers In 2017",
        "description":  "With the release of Visual Studio 2017 and Visual Studio for Mac as well as .NET Core 2.0 framework, a lot has changed in for the .NET frameworks and tools. In this demo-filled session, Scott will highlight the most important new features in the .NET frameworks, languages and tools that will make you a more productive developer in the year ahead.",
        "id":  "netfordevelopersin",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Orin Thomas",
        "track":  "it",
        "title":  "Azure Security Center",
        "description":  "Just because you\u0027ve deployed your workloads to the cloud doesn\u0027t mean that you can stop thinking about security. Azure Security Center assists you in detecting, preventing, and responding to threats to the workloads that you\u0027ve deployed into Azure. In this session you\u0027ll learn how to configure, manage and understand the security monitoring functionality and policy based management available for your Azure subscription. You\u0027ll learn how to leverage Azure Security Center to analyze security data from your workloads, how to manage security alerts, how to respond to attacks and prevent future attacks.",
        "id":  "azuresecuritycenter",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Dustin Campbell",
        "track":  "dev",
        "title":  "Dig Into C# And Visual Basic Code-Focused Development With Visual Studio",
        "description":  "Microsoft Visual Studio is a productivity game-changer for C# and Visual Basic. The .NET Compiler Platform (Roslyn) enables many new experiences that will change the way you write and debug code. In this session, we dig into features that bring a new level of awesome to the C#/VB languages and IDE experience. Learn about new language features, refactoring support, major debugging enhancements, code aware frameworks, and much more.",
        "id":  "digintocandvisualbasiccodefocuseddevelopmentwithvisualstudio",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Dan Wahlin",
        "track":  "dev",
        "title":  "Docker: Creating The Ultimate Development Environment",
        "description":  "In this session Dan Wahlin (part of the Docker Captain\u0027s group) will show you how Docker can be used to create a development environment that allows you to mirror services on your local machine. In this session you\u0027ll learn about Docker core concepts, how to automate bringing up multiple application services with Docker Compose and how images and containers can simplify your development life.",
        "id":  "dockercreatingtheultimatedevelopmentenvironment",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "John Savill",
        "track":  "it",
        "title":  "Json Templates For The It Pro",
        "description":  "JavaScript Object Notation may as well be another language to IT admins however it’s really not as bad as it seems and understanding JSON is critical to using Azure and many other services today. In this session the format of JSON will be explored and more importantly good sources to obtain templates and how to edit them with a number of different tools including web-based tools, VS Code and Visual Studio with a special focus on JSON template management with Azure Resource Manager.",
        "id":  "jsontemplatesfortheitpro",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Seb Matthews",
        "track":  "it",
        "title":  "Manage Office 365 Like A Ninja (Part 1)",
        "description":  "Ninjas move quietly, disturb nothing and get the job done. Office 365 Admins need to be like ninjas – the 24x7 nature of Office 365 means that users are able to use their IT systems like never before. The Martini principle of ‘anytime, anyplace, anywhere’ means that the Office 365 IT Pro needs to be faster, wiser and stealthier than ever before. In part one of a two-part series unique to DevIntersection, international consultant and speaker Seb will walk through: \n\n• The Office 365 Portal\n• PowerShell fundamentals for Office 365\n• Groups, Planner and other Office 365 elements\n\n\nPacked with indispensable advice from the real-world, if you’re responsible for the management of your Office 365 tenant, trying to understand what’s involved, or you just want to know more, these sessions are for you.",
        "id":  "manageofficelikeaninjapart1",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Jay Schmelzer",
        "track":  "dev",
        "title":  "Moving Application Development And Testing To The Cloud",
        "description":  "Not every organization and application is ready to move to cloud for production for a variety of reasons. In this session we\u0027ll show you how organizations that have on-premise deployments are still able to take advantage of the cloud to create a productive and consistent environment for developing and testing their applications.",
        "id":  "movingapplicationdevelopmentandtestingtothecloud",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Tim Chapman",
        "track":  "sql",
        "title":  "New Security Features In Sql Server 2016",
        "description":  "SQL Server 2016 has made incredible enhancements in the realm of data security. Database administrators can now mask critical data from end users who need to see only specific portions of important information. Specific data can be returned to users based solely up the permissions the user has been given to see that data. In addition, can data be encrypted in its entire lifecycle. This new feature allows for applications to transparently handle encrypted data - leaving the database administrator without the ability to see this sensitive data. This session will cover these amazing new features in depth as well as include several demos on how these new features can be incorporated into upgraded customer environments.",
        "id":  "newsecurityfeaturesinsqlserver",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Jonathan Kehayias",
        "track":  "sql",
        "title":  "Sql Server Performance Tuning: Plan Cache Analysis",
        "description":  "The plan cache in SQL Server has a wealth of information available to assist developers and DBA’s with performance tuning. This session will show how to query the plan cache to find plan information and then how to parse the XML plans contained in the cache to identify missing indexes by query, high cost parallel queries with high usage counts, implicit column conversions caused by data type mismatches, and other interesting information about how queries have executed in the system.",
        "id":  "sqlserverperformancetuningplancacheanalysis",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Brent Ozar",
        "track":  "sql",
        "title":  "Troubleshooting Sql Server Backup And Restore Problems",
        "description":  "You’re already familiar with full, differential, and log backups – but what happens when someone says they accidentally deleted 15 records an hour ago? What happens when one log file backup disappears? What happens if you need to restore to an exact point in time? Learn some surprising answers before you get bitten by a real emergency, and learn Brent Ozar\u0027s tricks to work around these issues.",
        "id":  "troubleshootingsqlserverbackupandrestoreproblems",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Aaron Bertrand",
        "track":  "sql",
        "title":  "T-Sql: Bad Habits \u0026 Best Practices",
        "description":  "In this session, you will learn about various anti-patterns and why they can be bad for performance or maintainability. You will also learn about best practices that will help you avoid falling into some of these bad",
        "id":  "tsqlbadhabitsbestpractices",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Jesse Liberty",
        "track":  "dev",
        "title":  "Typescript For C# Developers",
        "description":  "C# developers come to TypeScript from a very different perspective than JavaScript developers, In this session we will cover TypeScript as a first class language and show its similarities (and differences) to C#.",
        "id":  "typescriptforcdevelopers",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Mark Rackley",
        "track":  "it",
        "title":  "Utilizing Jquery In Sharepoint - Get More Done Faster",
        "description":  "JavaScript, REST, CSOM, Office 365 APIs: Like it or not, client-side development is the future of SharePoint development. At the forefront of this wave is the powerful JavaScript library jQuery. Utilizing jQuery in SharePoint, developers can take their applications to the next level in less time. What\u0027s more, you can utilize jQuery in SharePoint 2007, 2010, 2013, and in Office 365 often without making changes to your code. In this class, you gain a new appreciate for jQuery and learn: \n\n\"What\u0027s possible,\" including visual enhancements and practical business intelligence\nTips and Tricks for deploying and maintaining scripts\nHow to get quick wins with little effort using third-party jQuery libraries\nHow to interact with SharePoint forms and lists using JavaScript and jQuery",
        "id":  "utilizingjqueryinsharepointgetmoredonefaster",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Jerry Nixon",
        "track":  "dev",
        "title":  "Xaml Design Patterns You Can Use Today",
        "description":  "There is no user interface platform more productive than XAML. Developers declaratively mark up applications and a dynamic, high-end user interface quickly takes shape. But is there a better way? Over the past decade, XAML developers have identified common conundrums to solve and have proven many design patterns to solve those problems. Come learn what other XAML developers already know, the most common design patterns applications and the best, easiest way to implement them.",
        "id":  "xamldesignpatternsyoucanusetoday",
        "endTime":  "2017-05-22T19:00:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-22T18:00:00Z"
    },
    {
        "speakers":  "Steve Smith",
        "track":  "dev",
        "title":  "Asp.Net Core Mvc Features And Filters",
        "description":  "In MVC applications, it\u0027s best to keep as your controllers on a diet. If they\u0027re getting bloated, one approach to getting them back into shape is to add filters to handle cross-cutting concerns. Sometimes, it\u0027s not individual controllers but the whole controllers folder that\u0027s getting out of hand. In that case, you may want to break things up by feature, to make things easier to find. You\u0027ll be ready to apply both of these techniques immediately after this session.",
        "id":  "aspnetcoremvcfeaturesandfilters",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Joe Guadagno",
        "track":  "dev",
        "title":  "Build Native Mobile Apps Using Javascript And Ionic",
        "description":  "Ionic lets you build mobile apps using only JavaScript. The Ionic framework is a free and open source, library of mobile-optimized HTML, CSS and JS components along with tools for building highly interactive native and progressive web apps. Built with Sass, optimized for AngularJS. In this session, you will see how you can build rich powerful, robust, mobile applications that are clean simple and functional. These applications can use Cordova, Phonegap to deploy natively or be a modern day web application. \n\nAll you need for this session is to know are HTML, CSS, and JavaScript: the building blocks of the web. You’ll even learn AngularJS as you work with Ionic and this talk.",
        "id":  "buildnativemobileappsusingjavascriptandionic",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "James Montemagno",
        "track":  "dev",
        "title":  "Building Connected And Disconnected Mobile Applications",
        "description":  "Creating a great connected experience across multiple platforms is an essential element of great mobile applications. However, what happens when there is little to no connectivity-such as on an airplane or in some foreign countries? Does your mobile app effortlessly synchronize data when the device gets back online? Although users expect and deserve this type of behavior, James maintains that developing your own cloud backend and an API across all operating environments is time consuming and error prone. Even more, managing multiple projects, languages, IDEs, and continuous integration processes is unsustainable in the long run. Fear not! Industry leaders such as Amazon, Couchbase, and Microsoft can help solve this problem on iOS, Android, and Windows mobile devices. Join James to investigate the wide range of options for creating a connected and unconnected mobile experience. Come see a full implementation using the latest features of Azure App Service and mobile apps across iOS, Android, and Windows with Xamarin.",
        "id":  "buildingconnectedanddisconnectedmobileapplications",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Damian Brady",
        "track":  "it",
        "title":  "Continuous Deployment In 60M With Octopus Deploy",
        "description":  "Heard of Octopus Deploy but haven\u0027t had a chance to try it? Is your company using Octopus but you haven\u0027t explored it much yourself? Or are you an active user and want to learn some new tips and tricks? If deploying your app is harder than making a cup of coffee, this is a session you can\u0027t miss. \n\nStarting from scratch with fresh machines, we\u0027ll work our way towards a complete deployment automation pipeline for an example application. We\u0027ll install and configure the Octopus components, configure environments, set up projects, add deployment steps, and configure security. We\u0027ll even look at the API and how we can integrate with third party applications - everything you need for efficient and reliable end to end deployment. By the end of the session, we\u0027ll be deploying our app with a complete, working, continuous delivery pipeline. \n\nDespite being demo-centric, this session won\u0027t just be about the how. As we progress there\u0027ll be explanations of how and why Octopus works the way it does, and we\u0027ll discuss some of the DevOps best practices that drive the product. Whatever your exposure to Octopus Deploy, this session has something for you.",
        "id":  "continuousdeploymentinmwithoctopusdeploy",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Brian Noyes",
        "track":  "dev",
        "title":  "Hey Cortana, Make My Apps Rock!",
        "description":  "This is the era of digital transformation where even traditionally non-technical companies are building applications that do amazing things for their customers, their internal processes and stay ahead of the competition. The mundane line of business app is getting a new soul, and it is powered by Cortana. In this session we will introduce the set of services in the Cortana Intelligence Suite so that you are familiar with the powerful building blocks you can incorporate into your ASP.NET and mobile applications. From there we’ll leave you with ready-made solutions you can leverage directly in your applications to add capabilities like prediction, advanced analytics and powerful visualizations.",
        "id":  "heycortanamakemyappsrock",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Robert Green",
        "track":  "dev",
        "title":  "How Using Devops Practices Can Make You A Better Developer",
        "description":  "Improved deployment frequency. Faster time to market. Lower failure rates. Faster fixes and recovery time. These are some of the promises of DevOps. Whether you are an individual developer or working in a team, you can take advantage of DevOps practices. In this session, aimed at developers who are new to DevOps, you\u0027ll see how you can leverage the concepts of agile development, continuous integration and continuous delivery to build better software. And you\u0027ll see how to do this all from within Visual Studio and Visual Studio Team Services.",
        "id":  "howusingdevopspracticescanmakeyouabetterdeveloper",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Ben Miller",
        "track":  "sql",
        "title":  "In-Depth Temporal Tables In Sql 2016",
        "description":  "Have you ever wanted to know what the data looked like yesterday before a change was made? Have you cringed at the thought of creating triggers to get data changes logged for later analysis? Looking at a new feature in SQL 2016 called Temporal Tables gives you the ability to create a table that automatically keeps track of your data in time. Magic was never meant to be part of IT, but SQL Server has done a great job with this new feature. We will cover how to set it up, how it works, querying the tables including the history table and last but not least, how you can incorporate this feature into existing tables. Join me in a time travelling adventure to find out how you can leverage Temporal Tables in your world.",
        "id":  "indepthtemporaltablesinsql",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Mitchell Kruzel",
        "track":  "it",
        "title":  "Infrastructure From Code - A Walkthrough",
        "description":  "In this session we will work through a real world example of creating infrastructure from code. In this example we will use a TFS GIT Repository to source control all of our PowerShell deployment scripts. Using the TFS Build process we will: 1) test our PowerShell script to ensure the scripts are of good quality 2) Execute the source controlled PowerShell scripts to create VMs and 3) Use DSC to configure the newly provisioned VM. This will be a start to finish infrastructure deployment strategy. \n\nFrom this session, you will learn the basic client interactions with a GIT Repository, understand the basics of a TFS GIT Repository, learn how to set up a TFS Build to test and execute PowerShell scripts, and finally how to create a VM from a template and bootstrap a DSC Configuration into it.",
        "id":  "infrastructurefromcodeawalkthrough",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Jason Himmelstein, Seb Matthews",
        "track":  "it",
        "title":  "Manage Office 365 Like A Ninja (Part 2)",
        "description":  "Ninjas move quietly, disturb nothing and get the job done. Office 365 Admins need to be like ninjas – the 24x7 nature of Office 365 means that users are able to use their IT systems like never before. The Martini principle of ‘anytime, anyplace, anywhere’ means that the Office 365 IT Pro needs to be faster, wiser and stealthier than ever before. In part two of a two-part series unique to DevIntersection, international consultant and speaker Seb will walk through: \n\n• CSOM fundamentals\n• SharePoint Online the ‘New-fashioned’ way\n• Advance usage of PowerShell and Office 365\n\n\nPacked with indispensable advice from the real-world, if you’re responsible for the management of your Office 365 tenant, trying to understand what’s involved, or you just want to know more, these sessions are for you.",
        "id":  "manageofficelikeaninjapart2",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "David Feldman",
        "track":  "it",
        "title":  "Next Generation Collaboration With Team Sites, Groups, Planner And Delve",
        "description":  "Things have always moved faster in the cloud, but lately there has been a whole new generation of collaboration options for customers using SharePoint Online. Come learn about new team sites and publishing sites, about groups and the whole range of collaboration options that make this the best platform for enterprise collaboration and productivity.",
        "id":  "nextgenerationcollaborationwithteamsitesgroupsplanneranddelve",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Ward Bell",
        "track":  "dev",
        "title":  "Observables In Angular",
        "description":  "Observables are a functional approach to streams of events. \n\nObservables can represent animations, user interactions (clicks, mouse moves, etc), ajax, web sockets, arrays, iterables and much more. They’re richer than Promises and much easier to read, write, and compose than traditional event handler callbacks. Think of Observables as LINQ for events \n\nRxJS is the Observables implementation favored by Angular. Many Angular APIs return RxJS Observables. Other frameworks are jumping on board. Why not you? \n\nThis presentation covers what they are, when to use them, which RxJS operators you should know, and how to cope with errors as well as success.",
        "id":  "observablesinangular",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "David Pless",
        "track":  "sql",
        "title":  "Sql Server 2016: Alwayson Availability Groups Features",
        "description":  "Introduced in SQL Server 2012, the Always On Availability Groups feature is an enterprise-level high-availability and disaster-recovery solution. Always On Availability Groups maximizes the availability of a set of user databases as an availability group that fails over as a unit. In this session we will discuss the improvements available in SQL Server 2016 and how this increases the viability to leverage AlwaysOn Availability groups as a full High Availability / Disaster Recovery solution for reporting as well as OLTP workloads. \n\nWe will cover SQL Server 2016 use cases of the ‘increased number of secondaries’ and the improved diagnostic capabilities (fn_hadr* functions, AlwaysOn cluster DMVs). \n\nWe will cover SQL Server 2016 specific capabilities such as improved log performance, multiple replica automatic failover, failover based on database failure, fully readable secondaries for ‘round robin’ load-balancing, and basic AlwaysOn ‘Availability Groups’ for Standard edition.",
        "id":  "sqlserveralwaysonavailabilitygroupsfeatures",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Tim Radney",
        "track":  "sql",
        "title":  "Sql Server Performance Tuning: Server And Instance Metrics",
        "description":  "Figuring out how to get started tuning SQL Server performance can feel overwhelming at first. Where do you start? What should you look at? In this session you\u0027ll learn a systematic approach to tuning SQL Server. First we\u0027ll cover common instance level settings that can have a significant impact on SQL Server performance. Then we\u0027ll cover how to collect I/O metrics and pinpoint databases that have the highest latencies. Finally, we\u0027ll cover how to find high-cost queries and discuss the importance of having a good baseline to measure all these things against. If you\u0027ve been struggling to put together a performance-tuning process, this session is for you!",
        "id":  "sqlserverperformancetuningserverandinstancemetrics",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Tim Chapman",
        "track":  "sql",
        "title":  "Sql Server Security For Developers",
        "description":  "Database security is one of the most overlooked and least understood aspects of database development and administration. How permissions are assigned and who they’re assigned to may mean the difference between an app that works properly and one that can lead to catastrophe. In this session, Microsoft Engineer Tim Chapman provides a detailed overview of the SQL Server security paradigm as well as several concrete examples of how security is assigned, the reasoning behind it, and how to avoid gnarly security pitfalls.",
        "id":  "sqlserversecurityfordevelopers",
        "endTime":  "2017-05-22T20:45:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-22T19:30:00Z"
    },
    {
        "speakers":  "Shep Sheppard",
        "track":  "it",
        "title":  "Data Science: What Is It And Do I Need It?",
        "description":  "",
        "id":  "datasciencewhatisitadndoineedit",
        "endTime":  "2017-05-23T13:30:00Z",
        "room":  "Swan 2 - 3",
        "startTime":  "2017-05-23T12:30:00Z"
    },
    {
        "speakers":  "",
        "track":  "it",
        "title":  "Microsoft\u0027s Open Source Journey: Are We Done? Or Just Getting Started?",
        "description":  "",
        "id":  "microsoftsopensourcejourneyarewedoneorjustgettingstarted",
        "endTime":  "2017-05-23T13:30:00Z",
        "room":  "Swan Ballroom",
        "startTime":  "2017-05-23T12:30:00Z"
    },
    {
        "speakers":  "Brent Ozar",
        "track":  "sql",
        "title":  "Always On Availability Groups: Backup And Checkdb",
        "description":  "You’ve decided to implement Always On Availability Groups, but now the really tricky part starts: where should you run backups and DBCCs? You’ll get a set of client requirements, design your own maintenance strategy, and then Brent will throw surprise curveballs at your design to see how it handles various real-world emergency scenarios",
        "id":  "alwaysonavailabilitygroupsbackupandcheckdb",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Kimberly Tripp",
        "track":  "sql",
        "title":  "Anatomy Of A Data Modification: Locking \u0026 Isolation",
        "description":  "Do you know the logical and physical steps that SQL Server goes through in order to process your data? Did you know that default level of isolation (read committed) is also referred to as inconsistent analysis? Do you know how to reduce the inconsistencies possible in long running queries? Come to this session to demystify locking and isolation and get a better grip on what’s really going on when it seems like nothing’s going on.",
        "id":  "anatomyofadatamodificationlockingisolation",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Ward Bell",
        "track":  "dev",
        "title":  "Asp.Net Core And Angular",
        "description":  "ASP.NET Core is a total redesign of Microsoft’s ASP.NET platform with an eye toward high performance, cross-platform, cloud-hosted applications. \n\nGoogle’s Angular is a total redesign of its immensely popular AngularJS platform for building client-side HTML/JavaScript applications running in the browser (SPAs) \n\nAfter a brief introduction to both, this talk turns to the tools, techniques, patterns and practice that bring them together. Discover the Angular application sweet spot, how to develop Angular apps in TypeScript in Visual Studio, and how to interact with the ASP.NET Core Web API. We’ll also dip into BreezeJS as a server-to-client data management layer that spans SQL Server, EntityFramework, Web API, and Angular.",
        "id":  "aspnetcoreandangular",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Tim Warner",
        "track":  "it",
        "title":  "Azure Ad Sso Deep Dive",
        "description":  "The pain point: You need to give your on-premises Active Directory users a single-sign on (SSO) experience with SaaS apps hosted in the Azure (and other) public clouds, and you have no clue how to begin. \n\nThe solution: In this session we\u0027ll examine the options for identity synchronization and SSO in the Microsoft Azure hybrid cloud scenario. We\u0027ll use Azure AD Connect to perform both basic password synchronization as well as ADFS-based identity federation to Office 365 and other cloud-based SaaS apps. \n\nHere are some of the things you\u0027ll know how to do after attending this presentation:\n• Configure account and password synchronization to Azure AD\n• Deploy ADFS-based identity federation with Azure AD\n• Set up SSO between Azure AD and various other SaaS apps \n\nTim set up a permanent session page and GitHub repository for this presentation, so you\u0027ll be able to recreate all examples and review all session materials at your leisure.",
        "id":  "azureadssodeepdive1",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Steve Smith",
        "track":  "dev",
        "title":  "Black Belt Asp.Net Core Middleware",
        "description":  "ASP.NET Core relies on components known as middleware for handling individual requests. Learn how middleware are composed together into a request pipline, and how to author your own full-featured middleware complete with configuration, logging, data access, and dependency injection support. Then package up your middleware as a nuget package and consume it from any ASP.NET Core app.",
        "id":  "blackbeltaspnetcoremiddleware",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Scot Hillier",
        "track":  "it",
        "title":  "Building Applications For Office 365 And Sharepoint With Angular 2, Typescript, And Asp.Net Core",
        "description":  "Angular 2 is a popular JavaScript single-page application (SPA) framework and a solid foundation for use in SharePoint development. In this session, Angular 2 and TypeScript will be used to build applications for Office 365 and SharePoint; both on-premises and in the cloud. Attendees will exit the session with new ideas for building stand-alone applications for Office 365 and SharePoint.",
        "id":  "buildingapplicationsforofficeandsharepointwithangulartypescriptandaspnetcore",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Dustin Campbell",
        "track":  "dev",
        "title":  "C# 7 – Simplify And Improve Your Code In 2017",
        "description":  "C# can be developed and run on more and more platforms, and thanks to the “Roslyn” language engine you can increasingly make your own tooling for it. C# 7 embraces several new features for working better with data, such as tuples and pattern matching. Come see how you can start using C# 7 today!",
        "id":  "csimplifyandimproveyourcodein",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Shep Sheppard",
        "track":  "sql",
        "title":  "Data Science: Visualization And Story Telling",
        "description":  "One of the four pillars of Data Science is Visualization! You can have all of the data in the world at your fingertips with lightning fast access speeds, but if you cannot represent the data to the consumer in a meaningful way and use it to tell a story, it is of zero value to anyone, and possibly misleading. The principles of visualization are independent of any product so we will stick to principles vs focusing on any visualization package. \n\nThis is a fun interactive session where we will review some very important visualizations in history and the principles behind what makes a good and bad visualization. Some visuals are truly worth a thousand words, or even a thousand lives if done well. By the end of this session you will be able to identify why a visualization is bad or good and how data to ink ratio, chart junk, and the lie factor impact and influence the consumers.",
        "id":  "datasciencevisualizationandstorytelling",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Michele Bustamante",
        "track":  "dev",
        "title":  "Message Brokers And Containers - The New Esb Is “No Esb”",
        "description":  "A microservices strategy favors “dumb pipes” and “smart endpoints” - unlike the traditional ESB. Services own the business logic and can evolve independently with the demands of the business domain. Messages are a mechanism for decoupling, discovery, choreography of system workflow, event sourcing, scale and audit - but they know nothing of the business domain. This session will explore how to design a microservices solution that relies on messages and event sourcing at the core. You’ll learn techniques for approaching the design, all the way through to implementation. While concepts discussed in this session are not platform specific, Michele will illustrate with demos using Kafka, Docker and Azure Container Service based on the Mesosphere DC/OS platform.",
        "id":  "messagebrokersandcontainersthenewesbisnoesb",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Don Jones, Jeffrey Snover",
        "track":  "it",
        "title":  "Powershell Unplugged",
        "description":  "Learn how the experts approach a new problem in PowerShell, iterate through console-based approaches to arrive at a solution, and then codify that solution in a tool that\u0027s built on native PowerShell patterns and principles. Bring your questions to this entirely ad-hoc, just-like-it-happens-in-real-life demonstration!",
        "id":  "powershellunplugged",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Brock Allen",
        "track":  "dev",
        "title":  "Securing Web Apis From Javascript/Spa Applications",
        "description":  "Modern web development means that more and more application code is running in the browser as JavaScript. This architectural shift requires us to change how we perform authentication and authorization. Fortunately, using modern protocols such as OpenID Connect you don’t need to invent your own solution for this new environment. This session will show you the modern approach for browser-based JavaScript applications to authenticate users, and perform secure web api invocations. As you might expect, security is sufficiently complex and so even modern security comes with its own set of challenges. Luckily, we will show off some libraries that help manage this complexity so your application doesn’t have to.",
        "id":  "securingwebapisfromjavascriptspaapplications",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Sean McDonough",
        "track":  "it",
        "title":  "Tapping The Power In Powershell",
        "description":  "PowerShell has been around in some form since 2005, but it was only with SharePoint Server 2010 that PowerShell became an official part of the SharePoint administrative landscape. Nowadays, PowerShell is the preferred mechanism for administrative management of SharePoint farms, both on-premises and in the cloud with SharePoint Online. In this session, we’ll be taking a more advanced look at PowerShell and how it can be used to execute and script administrative actions for SharePoint. We’ll look at some common SharePoint activities that are carried-out through PowerShell, as well as some of the newer PowerShell capabilities like desired state configuration (DSC). We’ll also look at some PowerShell watch-outs including some behaviors that can sometimes cause trouble with SharePoint. Administrators and developers alike will leave this session with a variety of concepts and script samples that can be used to immediately improve operations within their own SharePoint environments.",
        "id":  "tappingthepowerinpowershell",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Erin Stellato",
        "track":  "sql",
        "title":  "The Roadmap To Better Performance: Reading Query Plans, Part I",
        "description":  "Whether you’re a DBA or a developer, you probably know that when you submit a query to SQL Server it generates a plan – a map if you will – that determines how it will get the data you’ve requested. But if you’re not familiar with how to read that map, then how do you know how to create a faster route to the data? How can you tune a query? If you’ve been lost when looking at plans before, then attend this session where we will cover the basics of query plans. We\u0027ll step through how to capture plans, discuss the essential information to review in a plan, and talk about what you can ignore when looking at a plan. This session will be filled with demos so that the next time you\u0027re asked to help with a query, you know where to start.",
        "id":  "theroadmaptobetterperformancereadingqueryplanspart",
        "endTime":  "2017-05-23T15:00:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-23T14:00:00Z"
    },
    {
        "speakers":  "Brady Gaster",
        "track":  "dev",
        "title":  "Developing For Azure On A Mac",
        "description":  "With the introduction of .NET Core, many developers who have previously been married to Windows to do their .NET development are now investigating other platforms. By the same token, many developers familiar to the Mac who have been unable to use .NET are now interested in trying it out but aren’t sure what tools they’ll need. This session will target both audiences and take an intermediate-level tour of how to get started developing .NET applications on a Mac using Visual Studio Code and a series of command-line utilities and extensions. We’ll also investigate how the Azure Tools Extension for Visual Studio Code can be useful when paired with the Azure Portal’s in-browser tools to make developing your Web, Mobile, and RESTful APIs on Azure easy, and how Azure Containers and Docker can bring true portability and flexibility to your DevOps story.",
        "id":  "developingforazureonamac",
        "endTime":  "2017-05-23T15:15:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-23T15:00:00Z"
    },
    {
        "speakers":  "Rob Windsor",
        "track":  "it",
        "title":  "Building Your First App With The Microsoft Graph (Office 365 Apis)",
        "description":  "The Microsoft Graph is to Office 365 what the REST API and CSOM are to SharePoint. It is a unified endpoint that provides access to a set of RESTful web services (the Office 365 APIs) that enable you to build applications that work with users, groups, calendars, files, tasks, people, notes and more. This session shows you how you can use free tools and resources to build an application that uses the Microsoft Graph. The topics discussed in the session include: using the API explorer, registering an app with Azure Active Directory, Visual Studio tooling, using the REST services, and using the SDK.",
        "id":  "buildingyourfirstappwiththemicrosoftgraphofficeapis",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Carl Franklin",
        "track":  "dev",
        "title":  "Bulletproof Transient Error Handling With Polly",
        "description":  "Connected applications only work when connected. What happens if the network breaks temporarily? Will your system recover smoothly or pitch a fit? Using an OSS project called Polly (available on GitHub and now part of the .NET Foundation) you can handle this and many other transient situations with elegance and fluency. Polly let’s you define retry policies using standard patterns such as retry, retry forever, wait and retry, and circuit breaker. Learn how to make your system bulletproof with Polly and a little know-how.",
        "id":  "bulletprooftransienterrorhandlingwithpolly",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Shep Sheppard",
        "track":  "sql",
        "title":  "Data Science: Azure Ml - A Rapid Introduction For Dba’S",
        "description":  "In this session and using readily available data, you will see demos and tutorials that you can go through during the session or take home and practice to get a jump start in Azure Machine Learning. You will learn how Azure ML can perform basic statistics as well as a walk-through of simple linear regression and a simple classification. All scripts and walk-throughs will be made available at the session.",
        "id":  "datascienceazuremlarapidintroductionfordbas",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Brent Ozar",
        "track":  "sql",
        "title":  "Design Quorum For Failover Clusters",
        "description":  "Before you touch anything with Always On in the name, you need to understand how cluster quorum works and how it can bring your SQL Server down. Learn how dynamic quorum and dynamic witness should be configured and see 3 real-world scenarios.",
        "id":  "designquorumforfailoverclusters",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Dan Usher, Scott Hoag",
        "track":  "it",
        "title":  "Directory Synchronization And Office 365 - Better Together",
        "description":  "Are you looking to reduce the number of post-it notes your end users have? Seeking to automate your user creation processes for Office 365? This session will go through the basics of identity in Office 365 and demonstrate to how to setup and configure Office 365 with Azure Active Directory using the Azure Active Directory Connect tools. You will learn:\n\n• The core concepts of Office 365 / Azure Active Directory user identity\n• Your identity synchronization options and available tooling\n• How to implement and configure tooling for identity synchronization",
        "id":  "directorysynchronizationandofficebettertogether",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Brian Noyes",
        "track":  "dev",
        "title":  "Getting Started With Aurelia",
        "description":  "Aurelia is a Single Page Application framework that is getting a lot of traction as an alternative to Angular. It includes a rich data binding system, dependency injection and modules, an intuitive and powerful routing and navigation system, and lots of extensibility throughout. In this session you will get a quick introduction to the capabilities of Aurelia and how to get started building applications with it.",
        "id":  "gettingstartedwithaurelia",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Mitchell Kruzel",
        "track":  "it",
        "title":  "Infrastructure From Code - A Walkthrough",
        "description":  "In this session we will work through a real world example of creating infrastructure from code. In this example we will use a TFS GIT Repository to source control all of our PowerShell deployment scripts. Using the TFS Build process we will: 1) test our PowerShell script to ensure the scripts are of good quality 2) Execute the source controlled PowerShell scripts to create VMs and 3) Use DSC to configure the newly provisioned VM. This will be a start to finish infrastructure deployment strategy. \n\nFrom this session, you will learn the basic client interactions with a GIT Repository, understand the basics of a TFS GIT Repository, learn how to set up a TFS Build to test and execute PowerShell scripts, and finally how to create a VM from a template and bootstrap a DSC Configuration into it.",
        "id":  "infrastructurefromcodeawalkthrough",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Jeff Fritz",
        "track":  "dev",
        "title":  "Introducing .Net Core 2.0",
        "description":  ".NET Core burst onto the scene with cross-platform support. In the time since its initial release, the team has added hundreds of new APIs to make development easier than ever. We will also look at .NET Standard and what this means for your projects: why would I want to use .NET Standard? How does this make my project better? What’s involved in making a .NET Standard project? We will review the new capabilities of .NET Core 2.0 and how to update your application from .NET Core 1.0 to 2.0.",
        "id":  "introducingnetcore",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Adam Tuliper",
        "track":  "dev",
        "title":  "Lessons Learned In Porting Legacy Asp.Net Applications To Asp.Net Core",
        "description":  "Are you looking to migrate any of your legacy ASP.NET applications to ASP.NET Core? Our team at Microsoft worked porting an application that consisted of several frameworks (SignalR, Entity Framework, Nancy, MVC, and custom middleware) to ASP.NET Core. We went in with little expectations and came out with many solid lessons learned. In this session, I’ll walk you through various items we ported and considerations and challenges we hit at each part. While our experience may be different based on the types of applications you are porting, this session should give you immediate insight into porting an application over to ASP.NET Core also running on .NET Core.",
        "id":  "lessonslearnedinportinglegacyaspnetapplicationstoaspnetcore",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Matthew D. Groves",
        "track":  "dev",
        "title":  "Querying Nosql With Sql: Having Your Json Cake And Selecting It Too",
        "description":  "Until recently, agile business had to choose between the benefits of JSON-based NoSQL databases and the benefits of SQL-based querying. NoSQL provides schema flexibility, high performance, and elastic scaling, while SQL provides expressive, independent data access. Recent convergence allows developers and organizations to have the best of both worlds. \n\nDevelopers need to deliver apps that readily evolve, perform, and scale, all to match changing business needs. Organizations need rapid access to their operational data, using standard analytical tools, for insight into their business. In this session, you will learn the ways that SQL can be applied to NoSQL databases (N1QL, SQL++, ODBC, JDBC, and others), and what additional features are needed to deal with JSON documents. SQL for JSON, JSON data modeling, indexing, and tool integration will be covered.",
        "id":  "queryingnosqlwithsqlhavingyourjsoncakeandselectingittoo",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Orin Thomas",
        "track":  "it",
        "title":  "Securing Azure: Azure Ad Privileged Identity Management",
        "description":  "Azure AD Privileged Identity Management allows you to control how privileged accounts can be used in your organization\u0027s Azure subscription. In this session you\u0027ll learn how to configure Azure AD PIM to leverage \"Just In Time\" administration, so that you can limit administrative privileges so that they can only be used for a finite amount of time. You\u0027ll learn how to configure and manage the steps that must be taken to activate an administrative role, including requiring MFA, requiring additional information such as a support ticket ID, and emailing notifications to a separate mailbox each time an administrative role is activated. You\u0027ll also learn how you can audit Azure AD PIM role activations, delegate roles and configure security alerts.",
        "id":  "securingazureazureadprivilegedidentitymanagement",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Erin Stellato",
        "track":  "sql",
        "title":  "The Roadmap To Better Performance: Reading Query Plans, Part Ii",
        "description":  "There\u0027s a lot of information in a query plan, and understanding how to leverage it when performance tuning is a valuable skill. Throw in issues such as cardinality, data structures, and residual predicates, and suddenly the volume of what you need to know can become tricky to step through and effectively tune queries. In this session, we will cover how to focus on particular patterns you can apply that take the guessing out of plan-based tuning. There are good things to look for, as well as bad, and these patterns will help you develop a methodology to accelerate both your confidence with reading plans and the performance of your queries.",
        "id":  "theroadmaptobetterperformancereadingqueryplanspartii",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Paul Randal",
        "track":  "sql",
        "title":  "Understanding Logging And Recovery",
        "description":  "Just what is the transaction log and why is it there? Some of the most misunderstood parts of SQL Server are its logging and recovery mechanisms. The fact that the transaction log exists and can cause problems if not managed correctly seems to confound many DBAs. In this in-depth session you will learn the mysteries of the transaction log – its architecture and behavior under different recovery models- as well as how logging and recovery work in SQL Server. This is essential knowledge you need for understanding how backup, restore, log-shipping, database mirroring, and other technologies work.",
        "id":  "understandingloggingandrecovery",
        "endTime":  "2017-05-23T16:15:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-23T15:15:00Z"
    },
    {
        "speakers":  "Erin Stellato",
        "track":  "sql",
        "title":  "Answering The Question, \"What Happened?\" With Query Store",
        "description":  "One of the most highly anticipated new features in SQL Server 2016 is Query Store. It\u0027s been referred to as the \"flight recorder\" for SQL Server because it tracks query information, namely query plans and runtime statistics. If you\u0027ve ever had to drop everything to troubleshoot a sudden change in performance, then you\u0027ve probably already realized the value of this feature. \n\nIn this session, we\u0027ll step through how Query Store works - you’ll understand what information it captures and how to access the historical data through the UI and the system views. Then, we\u0027ll look at the data collected to identify queries that don\u0027t perform well and those that have regressions in performance due to different plans. Finally, we\u0027ll see how to force a specific plan for a query, discover what happens when the optimizer cannot use that plan, and examine how plan forcing compares to using plan guides. Expect to learn how to make troubleshooting easier with this feature that’s included in all editions of SQL Server 2016!",
        "id":  "answeringthequestionwhathappenedwithquerystore",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Joe Guadagno",
        "track":  "dev",
        "title":  "Bootstrap 4.0 – What’S New?",
        "description":  "Bootstrap is the world’s most popular framework for building responsive, mobile-first sites and applications. Inside you’ll find high-quality HTML, CSS, and JavaScript to make starting any project easier than ever. Bootstrap 4.0 is just around the corner (or here already). Let’s take a look at what’s new in version, what is no longer available, and what you have to do to upgrade your applications. Then we’ll take a look at some of the new features in detail like the Flexbox, Cards, improved NavBar and much more!",
        "id":  "bootstrapwhatsnew",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "James Montemagno",
        "track":  "dev",
        "title":  "Continuous Integration \u0026 Delivery For The Mobile Developer",
        "description":  "abstract coming soon",
        "id":  "continuousintegrationdeliveryforthemobiledeveloper",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Shep Sheppard",
        "track":  "sql",
        "title":  "Data Science: Sql Server R - A Rapid Introduction For Dba’S!",
        "description":  "In this session and using readily available data, you will see demos and tutorials that you can go through during the session or take home and practice to get a jump start in SQL Server R. You will learn basic R commands, basic statistics in R, walk-throughs of simple linear regression and simple classification from R Studio as well as from within SQL Server Management Studio. All scripts and walk-throughs will be made available at the session.",
        "id":  "datasciencesqlserverrarapidintroductionfordbas",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Jonathan Kehayias",
        "track":  "sql",
        "title":  "Deadlocking For Mere Mortals",
        "description":  "While the improvements in SQL Server 2005 and 2008 made troubleshooting deadlocks significantly more straightforward, deadlocks still continue to be a constant source of questions in the forums online. This session will look at the most common deadlocks encountered and how to troubleshoot them using the various methods available to DBA’s today; including Trace Flags, SQL Trace, Event Notifications, and Extended Events.",
        "id":  "deadlockingformeremortals",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Jason Himmelstein",
        "track":  "it",
        "title":  "Deploy And Provision Best Practices With Microsoft Sharepoint Server 2016",
        "description":  "Microsoft SharePoint Server 2016 provides a new suite of IT capabilities to drive improvements in both scale and resiliency. Learn the best practices to deploying and provisioning SharePoint Server 2016 with these capabilities in mind. Understand requirements and proper foundation to building a stable, scale-able platform to take your business into the next evolution of SharePoint.",
        "id":  "deployandprovisionbestpracticeswithmicrosoftsharepointserver",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Jesse Liberty",
        "track":  "dev",
        "title":  "Fundamentals Of Test Driven Development",
        "description":  "This session assumes no prior experience with Unit Testing and dives into the principles and practical aspects of TDD. A real world demonstration will bring these concepts together.",
        "id":  "fundamentalsoftestdrivendevelopment",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Stephen Fluin",
        "track":  "dev",
        "title":  "How To Think About Angular",
        "description":  "Angular is a platform that plays many roles across different organizations. Learn about the ways that Angular sees its own role as part of the development efforts of modern companies, and learn about various models for incorporating Angular into your teams and processes.",
        "id":  "howtothinkaboutangular",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Jay Schmelzer",
        "track":  "dev",
        "title":  "Moving Application Development And Testing To The Cloud",
        "description":  "Not every organization and application is ready to move to cloud for production for a variety of reasons. In this session we\u0027ll show you how organizations that have on-premise deployments are still able to take advantage of the cloud to create a productive and consistent environment for developing and testing their applications.",
        "id":  "movingapplicationdevelopmentandtestingtothecloud",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Jeffrey Snover",
        "track":  "dev",
        "title":  "Powershell Futures",
        "description":  "Abstract coming",
        "id":  "powershellfutures2",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Mitchell Kruzel",
        "track":  "it",
        "title":  "Powershell Toolmaking For A Corporate Environment",
        "description":  "In this session we create PowerShell Modules that can be used throughout the corporate environment. Have you ever created a script that you wanted to share with someone else? Or make a tool that requires upkeep periodically? Have you ever broken your script with a change? This session offers a solution to these situations. We will formalize our scripting process by working with source control and use a TFS Build Process to test/publish our modules to an internally hosted PackageManagement Repository. \n\nFrom this session you will learn the basic client interactions with a GIT Repository, understand the basics of a TFS GIT Repository, learn how to set up a TFS Build to test and execute PowerShell scripts, and finally how to create, version, and publish a PowerShell module to an PackageManagement Repository.",
        "id":  "powershelltoolmakingforacorporateenvironment",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Kimberly Tripp",
        "track":  "sql",
        "title":  "Sql Server Indexing: Strategies For Performance",
        "description":  "SQL Server has clustered and nonclustered b-tree indexes, clustered and nonclustered columnstore indexes, and even a few other specialized types of indexes. It can be hard to know the correct direction to take for your data? Join Kimberly in this session to get an overview of when and why you should use combinations of these with emphasis on answering these main questions: \n\n1. How does SQL Server version affect indexing choices / strategy?\n2. What criteria should you look for in data access patterns and usage patterns?\n3. What makes a good base table structure (clustered b-tree v. clustered columnstore)? \n4. What can you do now? What are your plans for migration? \n\nIf you want to know the RIGHT way to index your tables – from DESIGN to TEST to PRODUCTION – this is the place to be!",
        "id":  "sqlserverindexingstrategiesforperformance",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Stephanie Donahue",
        "track":  "it",
        "title":  "Taming The Hoarders...Organizing Users Who Keep Everything!",
        "description":  "Email, file shares, documents, legacy systems, metadata…..it can be overwhelming. Whether you are planning a brand-new SharePoint implementation, migrating from another system, or supporting the SharePoint site you already have, this presentation will help you get (and stay) organized. I will take you through some tips and tricks for organizing even the most challenging users in SharePoint:\n\n• Learn about locations that users typically hoard save their data\n• Learn methods to help difficult users adopt SharePoint\n• Review easy ways to plan your site architecture\n• Discuss training methods that will increase user engagement",
        "id":  "tamingthehoardersorganizinguserswhokeepeverything",
        "endTime":  "2017-05-23T18:30:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-23T17:30:00Z"
    },
    {
        "speakers":  "Jeff Fritz",
        "track":  "dev",
        "title":  ".Net Framework Improvements, Tips, And Tricks",
        "description":  "There’s a lot of talk about the .NET Core framework, but what about the .NET Framework for Windows? With the 4.7 release of .NET and the Windows 10 Creators Update, there are lots of improvments that you can use in your existing applications. Join Jeff Fritz as he demos many of the cool updates in the .NET Framework that you can use in your ASP.NET and windows applications.",
        "id":  "netframeworkimprovementstipsandtricks",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Brian Noyes",
        "track":  "dev",
        "title":  "Aurelia Data Binding In Depth",
        "description":  "Aurelia is a rich framework for Single Page Application development. It has many features that help you in developing rich client apps, but the feature that is most important to bringing it all together is the data binding system in Aurelia. In this session you will get a deep end to end coverage of the data binding capabilities of Aurelia and will learn how to leverage those capabilities while build Aurelia apps.",
        "id":  "aureliadatabindingindepth",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Tim Warner",
        "track":  "it",
        "title":  "Azure Networking Deep Dive",
        "description":  "The pain point: You need to give your on-premises Active Directory users a single-sign on (SSO) experience with SaaS apps hosted in the Azure (and other) public clouds, and you have no clue how to begin. \n\nThe solution: In this session we\u0027ll examine the options for identity synchronization and SSO in the Microsoft Azure hybrid cloud scenario. We\u0027ll use Azure AD Connect to perform both basic password synchronization as well as ADFS-based identity federation to Office 365 and other cloud-based SaaS apps. \n\nHere are some of the things you\u0027ll know how to do after attending this presentation:\n• Configure account and password synchronization to Azure AD\n• Deploy ADFS-based identity federation with Azure AD\n• Set up SSO between Azure AD and various other SaaS apps \n\nTim set up a permanent session page and GitHub repository for this presentation, so you\u0027ll be able to recreate all examples and review all session materials at your leisure.",
        "id":  "azureadssodeepdive2",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Damian Brady",
        "track":  "it",
        "title":  "Brownfields Devops In Practice",
        "description":  "Are you ready to continuously deploy every commit to production and deploy 25 times a day? Can your operations team tear down and spin up VMs and containers for your app like they\u0027re nothing? Can your company track production usage and toggle features at the whims of the marketing department? No? \n\nWe all know it\u0027s not quite that easy. You can\u0027t take an existing house-of-cards monolith and just start treating it like a unicorn, as much as everyone would like to. But as a developer, you can start to make practical inroads, and you can do it now. \n\nThis talk looks at DevOps culture from the point of view of a developer - how code changes can affect the agility of your organisation. We\u0027ll discuss architectural changes, design techniques, deployment pipelines, and how to make large changes safely. Developers at any level will leave with some practical ways to support your company\u0027s DevOps efforts and start working better with your ops team.",
        "id":  "brownfieldsdevopsinpractice",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Mark Rackley",
        "track":  "it",
        "title":  "Delivering A World Class Search Experience",
        "description":  "SharePoint search is one of the most underutilized features of SharePoint. With the proper use of search you can give your users a rich, powerful experience allowing them to find the information as easily as shopping for a product on amazon.com. In this demo packed sessions users will learn:\n\n- How to incorporate jQuery into display templates to take search to the next level\n- Best practices for using Content types to aggregate content across multiple sites or site collections\n- Create and use custom refiners to make search for a document as simple as finding a product on Amazon",
        "id":  "deliveringaworldclasssearchexperience",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Brian Clark",
        "track":  "dev",
        "title":  "Easy Web Application Security In Node.Js \u0026 Angular",
        "description":  "In this session we\u0027ll cover some of the small steps we can take to secure our web applications and demonstrate those steps in a Node.js, Express and Angular web application. You\u0027ll learn about three vulnerabilities and the steps to take in order to mitigate them. We\u0027ll also see how existing Node.js modules can make it simple to implement these mitigation techniques.",
        "id":  "easywebapplicationsecurityinnodejsangular",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "David Feldman",
        "track":  "it",
        "title":  "Getting Started With Powerbi",
        "description":  "Microsoft Power BI make it easy to create interactive data visualizations on a diverse number of data sources in the cloud or hybrid and deliver them to any device. Come to this demo heavy session to learn how to get started today and bring greater visibility to the data that matters to you.",
        "id":  "gettingstartedwithpowerbi",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Aaron Bertrand",
        "track":  "sql",
        "title":  "Sentryone: Tools For Productivity And Performance",
        "description":  "",
        "id":  "sentryonetoolsforproductivityandperformance",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Swan 2 - 3",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Dr. William L. Bain",
        "track":  "dev",
        "title":  "Supercomputing With Microsoft\u0027s Task Parallel Library",
        "description":  "As web and mobile applications face the challenge of quickly analyzing huge volumes of live data, developers are turning to data-parallel computing techniques to tackle these daunting computations. Microsoft\u0027s Task Parallel Library provides powerful operators for parallel computing on a multi-core server, but where should developers turn to handle data sets that outstrip the resources of a single server? This session will show how a distributed, in-memory data grid with an integrated compute engine can enable applications to run familiar TPL-based, data-parallel applications on a cluster of servers and achieve near supercomputer-level performance. \n\nKey Takeaways: \n\n1. Learn how to scale out computation across a cluster of commodity servers which together have enough DRAM to hold the application\u0027s state and enough cores to process it quickly.\n2. Learn how to leverage familiar concepts from .NET\u0027s Task Parallel Library (TPL) and apply them to data-parallel computing on a cluster to keep the programming model simple.\n3. By marrying the clean, data-parallel semantics of the TPL\u0027s Parallel.ForEach operator with the scalable in-memory storage and computing power offered by an in-memory data grid (IMDG) or distributed cache, the distributed ForEach operator gives developers an easy-to-use and cost-effective bridge to supercomputer performance.",
        "id":  "supercomputingwithmicrosoftstaskparallellibrary",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Jordan Matthiesen",
        "track":  "dev",
        "title":  "Visual Studio For Mac Tips \u0026 Tricks",
        "description":  "Visual Studio for Mac is a new member of the Visual Studio family for mobile-first, cloud-first development. You get everything you need for mobile, cloud and Mac development. Visual Studio for Mac has support for Xamarin, .NET Core and Azure connectivity. In this session, come hang out with Jordan as he takes you through tips and tricks to help you get the most out of Visual Studio for Mac. Suitable for beginners and experts alike!",
        "id":  "visualstudioformactipstricks",
        "endTime":  "2017-05-23T20:00:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-23T19:00:00Z"
    },
    {
        "speakers":  "Jesse Liberty",
        "track":  "dev",
        "title":  "Advanced Topics In C#",
        "description":  "This session will cover a number of advanced C# concepts including tuples, deconstruction, lambda expressions, asynchronous methods, extension methods and more.",
        "id":  "advancedtopicsinc",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "Elijah Manor",
        "track":  "dev",
        "title":  "An Introduction To React",
        "description":  "Facebook\u0027s React library has received quite a bit of attention lately. In this session we will describe what React is, who uses it, and why it\u0027s a compelling technology to use.\n\nAfter a high level overview we will start to unpacking the ins and outs of React components (creation/JSX/props/state/etc) and then discuss some of the gotchas when first starting development. \n\n\"\"My favorite part of React is what I loved about MooTools: to use it effectively you learn JavaScript, not a DSL: useful your whole career.\"\" --Ryan Florence \n\nReact by itself is fairly small and not overly complex. For a more comprehensive Single Page Application you need much more than just React. To address this concern we will discuss Facebook Flux architecture, introduce the concept of Isomorphic JavaScript, and identify other libraries that are common when building a full application.",
        "id":  "anintroductiontoreact",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "Tim Warner",
        "track":  "it",
        "title":  "Azure Architect: Iaas Or Paas?",
        "description":  "Abstract Coming Soon",
        "id":  "azurearchitectiaasorpaas",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "Daniel Egan",
        "track":  "dev",
        "title":  "Bots Are The New Enterprise Apps",
        "description":  "While many of the bots that you have seen can help you buy tickets to a movie, or book flights, or even add a mustache to a picture, bots can also be integrated into the enterprise. From bots that integrate with Jenkins to help you manage your build process, to handling first level support in a call center, conversation bots can be deployed in an enterprise in a very effective way. Let you users interact with systems in the communication channels they prefer (Facebook, Slack, Kik, Skype, email, sms) in one integrated solution. In this session we will show you how to utilize the BotFramework to build bots for your enterprise.",
        "id":  "botsarethenewenterpriseapps",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "Gina Montgomery",
        "track":  "it",
        "title":  "Jump Start Digital Collaboration With Office 365 Groups And Teams",
        "description":  "Today there are more than 96 million mobile workers! With our organizations shifting into more a digital workplace, easy-to-use and secure collaboration space is a necessity. Groups ties together a set of experiences and apps in Office 365 to let you hold conversations about what you are working on, get progress updates from the team, share files and more. Attendees will benefit from live hands-on demonstrations on end user experiences and administration capabilities for Groups and Teams while also hearing about real-world used cases.",
        "id":  "jumpstartdigitalcollaborationwithofficegroupsandteams",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "Richard Theodore",
        "track":  "dev",
        "title":  "The Future Role Of Ai In Apps For O365",
        "description":  "Abstract coming soon",
        "id":  "thefutureroleofaiinappsforo",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "Sean McDonough",
        "track":  "it",
        "title":  "Understanding And Leveraging Microsoft’S Enterprise Mobility + Security (Ems) Suite",
        "description":  "The Enterprise Mobility + Security (EMS) Suite is a product offering that receives a lot of attention and “air time” from Microsoft nowadays. Although many enterprise architects, technical decision makers, and IT Pros have heard about EMS, many don’t know exactly what it is and what it does. In this session, we will be looking closely at EMS and the growing set of identity, security, data, and device management problems that it addresses. We will look at each of the workloads and capabilities within EMS, how they work, and some practical examples of solutions involving each. We will also clear-up the confusion that frequently arises in understanding where Office 365 ends and EMS begins. By the end of this session, you will understand what EMS is, the role that it plays in secure cloud solutions, and why it is a natural fit for consumers already leveraging Office 365 in their day-to-day operations.",
        "id":  "understandingandleveragingmicrosoftsenterprisemobilitysecurityemssuite",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "Robert Green",
        "track":  "dev",
        "title":  "What\u0027s New In Visual Studio 2017",
        "description":  "Visual Studio 2017 has arrived and, no surprise, offers a ton of exciting new features. This session will provide a whirlwind tour of what\u0027s new in the latest version of Visual Studio. You\u0027ll see enhancements to code navigation, IntelliSense, refactoring, code fixes, and debugging. You\u0027ll see how live unit testing automatically runs impacted unit tests in the background as you edit your code. You\u0027ll see new language features, new tools for building mobile and UWP apps, new and improved tools for building apps powered by Azure, and more.",
        "id":  "whatsnewinvisualstudio",
        "endTime":  "2017-05-23T21:15:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-23T20:15:00Z"
    },
    {
        "speakers":  "",
        "track":  "it",
        "title":  "Security After Dark",
        "description":  "Hosted by Michele Leroux Bustamante and Brock Allen\nSponsored by Solliance, Inc.\nMust have an armband to attend.  Armbands distribute at Solliance Booth.",
        "id":  "securityafterdark",
        "endTime":  "2017-05-24T01:00:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-23T23:00:00Z"
    },
    {
        "speakers":  "Stephen Fluin",
        "track":  "it",
        "title":  "Angular Applications: Large Scale, Across Large Teams With Large Results",
        "description":  "",
        "id":  "angularapplicationslargescaleacrosslargeteamswithlargeresults",
        "endTime":  "2017-05-24T13:30:00Z",
        "room":  "Swan 5 - 10",
        "startTime":  "2017-05-24T12:30:00Z"
    },
    {
        "speakers":  "Michael Greene",
        "track":  "it",
        "title":  "Deploying For Day 100",
        "description":  "Sure you want to go to the cloud, but then what? Attend this session to learn best practices you can use at deploy time for bootstrapping servers on public or private clouds to hybrid operations services such as configuration management, monitoring, patching, protecting, etc. Focus on techniques that use infrastructure as code.",
        "id":  "deployingforday",
        "endTime":  "2017-05-24T13:30:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-24T12:30:00Z"
    },
    {
        "speakers":  "Sean McDonough",
        "track":  "it",
        "title":  "Designing For Optimal Performance In Sharepoint Online",
        "description":  "In the last several years, the growth in popularity and compelling value of Office 365 have resulted in many organizations adopting SharePoint Online rather than building an on-premises implementation. Developing for SharePoint Online shouldn’t be approached with the same mindset as developing for SharePoint on-premises, though. In this session, we’ll take a look at how SharePoint Online is implemented and how it differs from a typical on-premises implementation. We’ll examine why developing for the cloud is different, identify common development concerns, and demonstrate some good (and bad) development approaches. We’ll also look at some hands-on troubleshooting techniques that are available for diagnosing common SharePoint Online performance problems, as well as some solutions that can be applied. At the conclusion of this session, participants will have a greater understanding of SharePoint Online, how to develop for it, and how to perform basic performance troubleshooting in the cloud.",
        "id":  "designingforoptimalperformanceinsharepointonline",
        "endTime":  "2017-05-24T13:30:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-24T12:30:00Z"
    },
    {
        "speakers":  "Don Jones",
        "track":  "it",
        "title":  "The Dsc Pull Server, Deconstructed And Customized",
        "description":  "PowerShell\u0027s DSC pull server, as shipped with Windows, is a fairly primitive beastie. But once you learn how it works under the hood (powerful knowledge for troubleshooting, by thr way), you can start to reconstruct it as a more fully customized piece of infrastructure. Don Jones has been working on an OSS pull server alternative, and in this session he\u0027ll share what he\u0027s learned, what has worked, and what\u0027s yet to be conqeured.",
        "id":  "thedscpullserverdeconstructedandcustomized",
        "endTime":  "2017-05-24T13:30:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-24T12:30:00Z"
    },
    {
        "speakers":  "Buck Woody",
        "track":  "sql",
        "title":  "The Future Of The Rdbms Professional",
        "description":  "",
        "id":  "thefutureoftherdbmsprofessional",
        "endTime":  "2017-05-24T13:30:00Z",
        "room":  "Swan 2 - 3",
        "startTime":  "2017-05-24T12:30:00Z"
    },
    {
        "speakers":  "Dan Usher, Scott Hoag",
        "track":  "it",
        "title":  "To The Cloud! Using Azure As A Hosting Provider For Sharepoint",
        "description":  "To the cloud! This phrase seems to come up more often for organizations looking to reduce their SharePoint footprint and operational expenses in their on-premises data centers. This session will provide a brief overview of a few of the premier Infrastructure as a Service hosting providers for SharePoint, how SharePoint in the cloud stacks up against Office 365 and how to quickly get your SharePoint system built in a repeatable fashion for development environments in Azure. You will learn:\n\n• About the core Infrastructure as a Service (IaaS) providers and how they compare to Microsoft Azure\n• About the complexities of what is involved with implementing SharePoint in a cloud hosted environment\n• What some of the nuances and workarounds are for hosting SharePoint in the cloud",
        "id":  "tothecloudusingazureasahostingproviderforsharepoint",
        "endTime":  "2017-05-24T13:30:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-24T12:30:00Z"
    },
    {
        "speakers":  "Joe Sack",
        "track":  "sql",
        "title":  "Adaptive Query Processing With Azure Sql Db And Sql Server Vnext",
        "description":  "Microsoft is introducing a new family of adaptive query processing improvements that will enhance the performance of workloads that have historically been difficult to tune through classic methodologies. In this session we will cover three of the new improvements, including interleaved execution for multi-statement table valued functions, batch-mode execution adaptive joins, and batch-mode memory grant feedback. We’ll cover how you can determine if your workloads will benefit from these improvements and discuss how these features fit into your existing SQL Server performance tuning and troubleshooting strategy.",
        "id":  "adaptivequeryprocessingwithazuresqldbandsqlservervnext",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Steve Murawski",
        "track":  "it",
        "title":  "Application Automation With Habitat",
        "description":  "Configuration management has taken hold in the infrastructure management arena, but managing our applications with traditional configuration management tools can be painful and leaves some gaps to fill. These gaps leave people reaching for new ways to manage applications. Habitat is a re-thinking of how we can run our applications well, bringing all the benefits of containerization and cloud-style, standardized management to any and every application.",
        "id":  "applicationautomationwithhabitat",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Orin Thomas",
        "track":  "it",
        "title":  "Azure Backup And Site Recovery, Even For Non-Cloud Organizations",
        "description":  "Azure\u0027s Backup as a Service (BaaS) and Disaster Recovery as a Service (BaaS) services aren\u0027t just for organizations that run some or all of their IT infrastructure in the cloud. There are distinct advantages to using both Azure Backup and Site Recovery, including reducing the complexity of managing tapes, moving backup data to secure off-site locations as well as reducing costs around maintaining and testing a disaster recovery site. In this session you\u0027ll learn how you can deploy and manage Azure Backup and Site Recovery, making the transition from a traditional on-premises backup and DR regime to one that leverages the benefits of the cloud.",
        "id":  "azurebackupandsiterecoveryevenfornoncloudorganizations",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Elijah Manor",
        "track":  "dev",
        "title":  "Beyond The Basics With React",
        "description":  "Getting started with React doesn\u0027t take too long, but there are a whole lot of other concerns that come along that you, as a developer, will need to understand and tackle. After this session you will be exposed to concepts that are helpful when creating a large front-end application such as using a flux architecture, applying High Order Components, assessing performance concerns, integrating immutability, leveraging helpful unit testing libraries, and creating your own component pattern library.",
        "id":  "beyondthebasicswithreact",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Mark Rackley",
        "track":  "it",
        "title":  "Converting Your Cewpcustomizations To The Sharepoint Framework",
        "description":  "Abstract coming soon",
        "id":  "convertingyourcewpcustomizationstothesharepointframework",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Kathleen Dollard",
        "track":  "dev",
        "title":  "Functional Techniques For C#",
        "description":  "You are effective with the imperative, object oriented core of Java or .NET but you look longingly at the winsome smile of functional languages. If you play with your language’s functional features, never quite sure you’re getting it right or taking full advantage of them. This talk is for you. You’ll learn which code to attack with functional ideas and how to do it. You’ll look at code similar to what you write every day and see it transform from long difficult to follow code to short code that’s easy to understand, hard to mess up and straightforward to debug. Better yet, functional approaches ensure that patterns like async, logging and exception handling are consistent and transaction usage is clear. Apply these techniques while leveraging delegates, lambda expressions, base classes and generics.",
        "id":  "functionaltechniquesforc",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Paul Randal",
        "track":  "sql",
        "title":  "Index Fragmentation: Internals, Analysis, And Solutions",
        "description":  "As soon as you have more than one index on a table, you\u0027re going to start seeing fragmentation. Many people know that this fragmentation is bad, but why is it bad? And what is the best way to get rid of it? Come find out from the person who wrote the tools for detecting and removing index fragmentation. In this session, you’ll learn how fragmentation occurs and why the process that leads to it can often be as damaging to performance as the fragmentation itself. You\u0027ll also learn how to test for fragmentation, the different methods of removing it, and everything you need to consider when putting together an appropriate fragmentation-management strategy.",
        "id":  "indexfragmentationinternalsanalysisandsolutions",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Dan Wahlin",
        "track":  "dev",
        "title":  "Integrating Angular With Asp.Net Core Restful Services",
        "description":  "In this session Dan Wahlin will walk you through the process of creating an Angular app that communicates with an ASP.NET Core RESTful service. Throughout the session you\u0027ll learn about the role of RxJS and Observables in Angular services and how they can be used to subscribe to data. You\u0027ll also learn how ASP.NET Core can be used to expose JSON data to any type of client.",
        "id":  "integratingangularwithaspnetcorerestfulservices",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Nick Landry",
        "track":  "dev",
        "title":  "Lessons Learned From Real World Xamarin.Forms Projects",
        "description":  "Sometimes it’s not the 101 tutorial you need to help you in your development journey but to just talk to someone who has experience in implementing that technology in the real world. What are the gotchas, things to avoid or best practices others have learned that can give you a leg up in implementing a new technology within your current architecture. In this session we will cover real-world considerations in Xamarin.Forms projects such as UI design considerations when sharing a user experience across iOS, Android and Windows, including navigation paradigms, styling, and supporting older versions. We’ll also look at code-sharing pitfalls and best practices, choosing an MVVM framework, application resource sharing, and leveraging plugins and the Dependency Service to leverage platform-specific code. Lastly, we’ll talk about mobile DevOps, including source control in a cross-platform environment, gathering application analytics, crash logs, and handling app flighting during development and beta testing. Come learn from a wealth of knowledge accumulated in real-world cross-platform projects, and get ready to build your own.",
        "id":  "lessonslearnedfromrealworldxamarinformsprojects",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Ryan Salva",
        "track":  "dev",
        "title":  "Native Ui With Javascript: React Native",
        "description":  "ReactJS is one of the fastest growing JavaScript frameworks, thanks to its simplicity and shorter development time. Last year, the folks responsible for ReactJS (Facebook) also announced React Native, a way to write cross platform mobile applications for iOS and Android. At F8 this year, Microsoft announced Windows support for React Native. Apps built using React Native offer 100% native UI with full access to native APIs. In this talk, you’ll learn how React turns traditional JS development upside down, power user tips to make you successful on day one, strategies to maintain and improve your app over time and the benefits \u0026 disadvantages of React Native compared to Xamarin and Cordova",
        "id":  "nativeuiwithjavascriptreactnative",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "David Pless",
        "track":  "sql",
        "title":  "New Features With Sql Server 2016 Reporting Services And Power Bi, Part I",
        "description":  "SQL Server 2016 is packed with new capabilities with SQL Server Reporting Services and self-service reporting with Power BI. In this session we will outline the new features and capabilities of SQL Server 2016 Reporting Services that puts the power of data in the hands of everyone. We will cover the alignment of Microsoft’s cloud and on-premises reporting solutions. We will cover how existing SSRS and Power BI expertise will transfer across these deployment modalities so you can mix and match on-premises and cloud components, and benefit from unique hybrid scenarios. We will cover paginated reporting, interactive reporting, mobile reporting, KPIs, dashboards, and analytical charting. \n\nWe will focus on the new capabilities of mobile reporting with the ‘Mobile Report Publisher’ and web based reporting which allows for greater consumption of your report capabilities across the enterprise. \n\nWe will cover the new visualizations across the reporting experience and how you can pin report visualizations to a Power BI dashboard and other methods in hybrid-connected reporting. We will cover new capabilities of Power BI embedded for application development. This further allows you to leverage your existing reporting investments in SQL Server Reporting Services and application solutions. We will walk through the new reporting features in SQL Server vNext. \n\nFinally, we will cover self-service visualizing and operationalizing data in Power BI. We will cover Power BI desktop, PowerBI.com, and the capabilities of Power BI Embedded. We will also address Power BI deployment options and best practices. Expect a demo driven delivery covering collaboration capabilities and integration with the Reporting Services ecosystem.",
        "id":  "newfeatureswithsqlserverreportingservicesandpowerbiparti",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Stephanie Donahue",
        "track":  "it",
        "title":  "Real World Use Cases For Powerapps And Flow",
        "description":  "Come to this session to learn how to leverage PowerApps and Flow in the real world to do real business processes. Get beyond the twitter demos and hello world apps and create something you can use right away in your organization! We will talk about vacation request forms in PowerApps, email-enabled libraries in SharePoint Online using Flow, and the future of business process automation in SharePoint Online.",
        "id":  "realworldusecasesforpowerappsandflow",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Bob Ward",
        "track":  "sql",
        "title":  "Sql Server Hybrid: What Every Sql Professional Should Know",
        "description":  "One of the tenants to Microsoft’s Cloud Strategy is Cloud on Your Terms through solutions that are global, trusted, and hybrid. Your choices range from pure cloud, on-premises, and hybrid cloud solutions. In this session, we will explore and look behind the scenes to see how SQL Server 2016 provides Hybrid Cloud capabilities. These include Azure SQL Stretch Database, SQL Server Backup and Restore to/from the Cloud, Database files in Azure Blob Storage, and Always On Availability Groups extended to Azure. We will look at the architecture that powers these technologies, talk about the business value and why you would want to choose these capabilities, plus some demonstrations to understand how to configure and see these features in action. If you have been thinking about what investments to make in Azure and SQL Server, come learn about how SQL Server 2016 Hybrid can you help move to the cloud on your terms.",
        "id":  "sqlserverhybridwhateverysqlprofessionalshouldknow",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Rob Lauer",
        "track":  "dev",
        "title":  "The Rise Of Javascript-Driven Native \u0026 Nativescript",
        "description":  "For nearly a decade, developers and IT organizations have been struggling to find the right way to build and maintain apps for the many platforms users depend on daily. Writing natively for every platform is still expensive, and many of the cross-platform solutions to date have forced developers to make compromises that hurt user experience. The industry has failed to produce app development solutions that deliver the code and skill portability IT leadership desires with the uncompromised, rich experiences users demand. Fortunately, a new wave of next generation platforms promises to radically improve the state of the art. “JavaScript-driven Native” platforms, like NativeScript, finally combine the skill and code portability of the web with the unlimited power of native platform UI. Put an end to your cross-platform app development woes and join this session to learn about JavaScript-driven Native and the open source platforms like NativeScript leading the way.",
        "id":  "theriseofjavascriptdrivennativenativescript",
        "endTime":  "2017-05-24T15:00:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-24T14:00:00Z"
    },
    {
        "speakers":  "Javier Lozano",
        "track":  "dev",
        "title":  "Azure For Asp.Net Developers",
        "description":  "Microsoft Azure is a simple, flexible, and open platform that makes developing Web applications extremely easy. In this session, we\u0027ll cover the features, practices, and patterns ASP.NET developers should consider when targeting the Azure platform. If you\u0027re curious on how you can take your applications, current and future, to the next level with ease, you won\u0027t want to miss this presentation.",
        "id":  "azureforaspnetdevelopers",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "David Feldman",
        "track":  "it",
        "title":  "Building Real World Solutions With Powerapps, Flow And Azure Function",
        "description":  "Come learn how to quickly create new SharePoint app user experiences with PowerApps and have them available on your user’s mobile devices. If that’s not enough excitement, we’re explore how Flow can enable us to orchestrate processes across platforms and clouds. This demo heavy session will build a number of application scenarios that you can start using right away.",
        "id":  "buildingrealworldsolutionswithpowerappsflowandazurefunction",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Macaw",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Tim Chapman",
        "track":  "sql",
        "title":  "Conquering Columnstore Indexes",
        "description":  "Introduced in SQL Server 2012, Columnstore Indexes have the power to completely transform a reporting environment. These indexes offer a solution for your reporting workload with an order of magnitude better data compression and query performance over traditional tables and indexes. SQL Server 2016 significantly enhances these indexes so that you can take advantage of them with your OLTP workload to enable something known as Operational Analytics. This session will dig into what Columnstore Indexes are, how they are implemented, and the advantages of using this technology in SQL Server 2016.",
        "id":  "conqueringcolumnstoreindexes",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Swan 3",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Steve Murawski",
        "track":  "it",
        "title":  "Continuous Delivery Of Infrastructure With Chef And Dsc",
        "description":  "From this session you will learn the basic client interactions with a GIT Repository, understand the basics of a TFS GIT Repository, learn how to set up a TFS Build to test and execute PowerShell scripts, and finally how to set build status based upon test results. From the build status we can then parse and understand the results of the infrastructure testing.",
        "id":  "continuousdeliveryofinfrastructurewithchefanddsc",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Pelican 2",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Rowan Miller",
        "track":  "dev",
        "title":  "Easy Data Access With Entity Framework Core 2.0",
        "description":  "The next evolution of Entity Framework Core is here with the 2.0 release. Join Rowan Miller’s demo-filled session as he shows you the new features of the framework and how you can easily work with all of your data sources easily and fluidly in a .NET application. You’ll walk away from this session with sample code that will help your .NET projects.",
        "id":  "easydataaccesswithentityframeworkcore",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Dan Roth",
        "track":  "dev",
        "title":  "Get Started Asp.Net Core 2.0",
        "description":  "Building high-performance cross-platform web applications has never been better than with ASP.NET Core. We will look at some of the new features of ASP.NET Core 2.0 and learn how our applications can benefit. We’ll also look at some performance tips and how you can take advantage of them.",
        "id":  "getstartedaspnetcore",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Mikkel Mork Heghhoj, Paul Yuknewicz",
        "track":  "dev",
        "title":  "Getting Started Developing .Net Cloud Applications On Azure Using Visual Studio",
        "description":  "How easy is it to get .NET application to run in Azure? Do .NET applications run better in Azure, and how? In this talk we will walk through the unique enhancements we have built in to Azure for giving your .NET applications the best fit in the cloud. We’ll show you a fast path to get existing apps up on Azure. We’ll also show you how to build modern scalable cloud app patterns for Web App and worker microservices using Docker. We’ll also show you how to be incredibly productive building and debugging your app using Visual Studio.",
        "id":  "gettingstarteddevelopingnetcloudapplicationsonazureusingvisualstudio",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Joe Sack",
        "track":  "sql",
        "title":  "Graph Database Processing With Azure Sql Db And Sql Server Vnext",
        "description":  "Microsoft is introducing native Graph database processing within SQL Server, allowing users to track relationships between entities and gain powerful insights from different pieces of connected data. Graph is well suited for applications where users need to extract information from different pieces of connected data, for example, IoT, fraud detection, recommendation engines, predictive analysis and beyond. The first version of Graph will include CRUD operations and T-SQL language extensions to support pattern matching for multi-hop navigation. In this session, we will review common use-cases and demonstrate how you can use SQL Graph to unlock more value from your data and increase operational agility.",
        "id":  "graphdatabaseprocessingwithazuresqldbandsqlservervnext",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Swan 2",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Jordan Matthiesen, Ryan Salva",
        "track":  "dev",
        "title":  "Moving Fast Without Breaking Things: Devops For Xamarin And React Native",
        "description":  "Xamarin and React Native brought the web\u0027s enviable reach to mobile development without sacrificing native UX along the way. While this makes for an amazing dev experience, the “last-mile” is still hard to setup and manage. Continuous integration, testing and distribution often stump even the most disciplined of teams. In this talk, we’ll learn how to leverage emerging tools and services to quickly make any GitHub repository “DevOps” ready. Whether you are distributing within your team, sharing with clients or deploying your app to the store, you’ll learn how to deliver bug fixes and new features 2, 3… even 4X per day. Then, because it’s important to understand your app’s in-market health, we’ll cover error reporting and user analytics. By the hour’s end, you’ll know how to set up automatic builds with every pull request, test apps on thousands of real-world devices and 400+ configurations, seamlessly distribute passing builds to beta testers, use CodePush to publish new features and bug fixing without resubmitting to the App Store and monitor production apps for crashes and bugs and collect mobile analytics to understand your users",
        "id":  "movingfastwithoutbreakingthingsdevopsforxamarinandreactnative",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "David Pless",
        "track":  "sql",
        "title":  "New Features With Sql Server 2016 Reporting Services And Power Bi, Part Ii",
        "description":  "SQL Server 2016 is packed with new capabilities with SQL Server Reporting Services and self-service reporting with Power BI. In this session we will outline the new features and capabilities of SQL Server 2016 Reporting Services that puts the power of data in the hands of everyone. We will cover the alignment of Microsoft’s cloud and on-premises reporting solutions. We will cover how existing SSRS and Power BI expertise will transfer across these deployment modalities so you can mix and match on-premises and cloud components, and benefit from unique hybrid scenarios. We will cover paginated reporting, interactive reporting, mobile reporting, KPIs, dashboards, and analytical charting. \n\nWe will focus on the new capabilities of mobile reporting with the ‘Mobile Report Publisher’ and web based reporting which allows for greater consumption of your report capabilities across the enterprise. \n\nWe will cover the new visualizations across the reporting experience and how you can pin report visualizations to a Power BI dashboard and other methods in hybrid-connected reporting. We will cover new capabilities of Power BI embedded for application development. This further allows you to leverage your existing reporting investments in SQL Server Reporting Services and application solutions. We will walk through the new reporting features in SQL Server vNext. \n\nFinally, we will cover self-service visualizing and operationalizing data in Power BI. We will cover Power BI desktop, PowerBI.com, and the capabilities of Power BI Embedded. We will also address Power BI deployment options and best practices. Expect a demo driven delivery covering collaboration capabilities and integration with the Reporting Services ecosystem.",
        "id":  "newfeatureswithsqlserverreportingservicesandpowerbipartii",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Swan 1",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Gina Montgomery",
        "track":  "it",
        "title":  "Office 365 Administration Tips In The Wild West Of Evergreen Updates And Services Galore",
        "description":  "Over the last few years, Office 365 has been evolving at a rapid pace, making more features and functionality available to users and admins on an almost daily basis. As this service evolves, it is even more important to be apprised on all the administration capabilities available. With new functionality for end users like Office 365 Groups, storage quotas can easily be disrupted without proper administration. Microsoft has also released a slew of new reporting functionality around SharePoint Online, OneDrive, Yammer, Exchange Online and Skype for Business Online. Join me in this session and see what all the newest admin buzz is about.",
        "id":  "officeadministrationtipsinthewildwestofevergreenupdatesandservicesgalore",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Michael Greene",
        "track":  "it",
        "title":  "Sharing Server Configurations In Enterprise Environments",
        "description":  "The problem with snowflakes is they tend to lose their shape. Do you really have time to think about these new idyllic infrastructure practices though? It’s not so bad, really. In this session we will discuss how to construct composable server configurations (small reusable pieces) and the tools available ranging from free to cloud services so that you can construct a private gallery of server deployment details that your organization can trust.",
        "id":  "sharingserverconfigurationsinenterpriseenvironments",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Mockingbird 2",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "Kimberly Tripp",
        "track":  "sql",
        "title":  "Statistics And Estimates: What You Need To Know!",
        "description":  "When SQL Server processes a query, it can be difficult to understand “why” it chose the method it did. In this session, Kimberly will define and demo when statistics are used and why it’s so important to have accurate and up-to-date statistics. If you’ve been confused about how SQL Server comes up with the estimates that it does – this is the place to be!",
        "id":  "statisticsandestimateswhatyouneedtoknow",
        "endTime":  "2017-05-24T16:15:00Z",
        "room":  "Swan 4",
        "startTime":  "2017-05-24T15:15:00Z"
    },
    {
        "speakers":  "John Papa, Shayne Boyer",
        "track":  "dev",
        "title":  "Api\u0027s For Angular Apps With Azure Functions",
        "description":  "",
        "id":  "apisforangularappswithazurefunctions",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Swan 10",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Paul Yuknewicz",
        "track":  "dev",
        "title":  "Azure Diagnostics: Fixing Cloud Applications Issues And Performance On Azure",
        "description":  "If you want to be 10x more efficient solving cloud reliability and performance issues, this session is for you. We’ll cover top issues we encounter in your application and infrastructure, and provide you with modern tools and techniques to effectively monitor, diagnose and fix these issues in all your environments, from dev-test to production at-scale. The session will cover our modern APM metrics and logging technology, Application Insights Profiler, and cloud debugger. Put on your seatbelts for this one!",
        "id":  "azurediagnosticsfixingcloudapplicationsissuesandperformanceonazure",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Swan 6",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Kathleen Dollard",
        "track":  "dev",
        "title":  "C# 7",
        "description":  "The newest version of C# makes every day code better while it moves us a little closer to functional programming. This talk covers how the new features simplify your current code without requiring obscure ways of thinking. \n\nPattern matching lets you drastically reduce the number of times you need to type if (varName != null). Pattern matching also makes beautiful switch statements, but you need to understand how the rules have changed. Prior to C# 7, the available options for returning multiple values from a method could most kindly be called contortions. C# 7 tuples solve this and other problems because they neatly and efficiently wrap transient data. Deconstruction, even overloaded deconstruction, let’s you extract just the values you want. You can use “out vars” to skip extra declarations. \n\nLearn about these features along with literals, local functions and a couple of niche features. As a bonus, you’ll see the new features in the next version of Visual Studio. You’ll leave ready to upgrade to C# 7 and you’ll understand the role it plays in our gradual move toward functional programming. ",
        "id":  "c",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Osprey",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Elijah Manor",
        "track":  "dev",
        "title":  "Css For Developers",
        "description":  "If you relate to any of the following personas, you\u0027re not alone. CSS for Developers aims to bridge the gap between using CSS to authoring and understanding CSS. \n\nJunior Jacob: Jacob is a junior developer who is new to Front-End Development and is trying to get his head around it. He just finished watching a PluralSight or Treehouse course on web development; he has learned most of the basics, but desires a deeper understanding of foundational concepts. \n\nBack-End Brian: Brian is a back-end developer who has a strong software development background, but CSS makes no sense to him and usually tries to avoid it. When he has to use it, he gravitates towards drop-in solutions such as Twitter Bootstrap, instead of learning how CSS works. \n\nMid-Level Melissa: Melissa is a mid-level web developer who is proficient in using CSS, but hasn\u0027t kept her skills up-to-date. She has a solid foundation and can build most any site asked of her, but the CSS she authors isn\u0027t organized well and is not maintainable. She wants to learn newer \u0026 more advanced CSS. \n\nThe first part of the talk is aimed at getting Jacob and Brian up to speed by introducing foundational concepts such as the Box Model, Specificity, Position, Cascading, and Sizing. Along the way, some advanced concepts that Melissa may have missed will be sprinkled in. \n\nAs the talk progresses, we will cover newer concepts such as Flexbox, Sass (intro/docs/linting), Atomic Design, BEM, Autoprefixer, and the concept of including your styles in JavaScript. Each persona will walk away with a set of tips, tricks, and techniques that help make CSS easier to organize, understand, and maintain.",
        "id":  "cssfordevelopers",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Swan 5",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Jen Looper",
        "track":  "dev",
        "title":  "How To Build A Great Oss Community In Ten Easy Steps",
        "description":  "So you have an Open Source (FOSS) project. And you need someone to use it? A common problem! As it turns out, the success of a FOSS project is directly dependent on the health of its community. In this talk, I’ll share ten tips on how to build a great community from scratch, based on our success building the NativeScript community, now almost 3000 strong on Slack and growing every day. Learn from our successes and our mistakes and leave with some concrete methods on how to build your community from zero to a whole bunch of heroes!",
        "id":  "howtobuildagreatosscommunityinteneasysteps",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Mockingbird 1",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Nick Landry",
        "track":  "dev",
        "title":  "Mobilizing Your Existing Enterprise Applications",
        "description":  "As an enterprise developer, your task is not just building projects from the latest and greatest technology but also brining your current systems into the mobile first world. In this session we will show you can mobilize your existing enterprise applications without the need for a total rewrite. We’ll explore how to current server components, services and databases can be exposed via a Web API, and also how you can take advantage of a hybrid cloud approach to extend your on-premises assets. Next we’ll discuss how to design a cross-platform mobile solution based on Xamarin to run on iOS, Android and Windows devices. We’ll cover code sharing, authentication \u0026 authorization, data synchronization \u0026 offline access, and other best practices. Extend the longevity and the reach of your existing systems by transforming them with maximum reuse for the mobile first, cloud first world.",
        "id":  "mobilizingyourexistingenterpriseapplications",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Pelican 1",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Stephanie Donahue",
        "track":  "it",
        "title":  "Planning For Office 365 Mobile Access",
        "description":  "The mobile landscape for Office 365 is vast and quickly changing. A year ago our focus was on simply getting to the cloud. Today many of us have already deployed Exchange, Skype, and SharePoint in Office 365 and are beginning to wonder what’s next as we begin to look at mobile access to Office 365. Join this session to learn about: \n\n• Overview of available Office 365 Applications and real world use scenarios\n• Discussing SharePoint Responsive Design vs using an App\n• Learn about the latest offerings for Microsoft’s Enterprise Mobility \u0026 Security Suite\n• The future of mobile forms and workflow with PowerApps and Flow",
        "id":  "planningforofficemobileaccess",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Parrot",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Bob Ward",
        "track":  "sql",
        "title":  "Sql Servier 2016: It Just Runs Faster",
        "description":  "",
        "id":  "sqlservieritjustrunsfaster",
        "endTime":  "2017-05-24T18:30:00Z",
        "room":  "Swan 2 - 3",
        "startTime":  "2017-05-24T17:30:00Z"
    },
    {
        "speakers":  "Scott Hanselman",
        "track":  "it",
        "title":  "Keynote - Hanselman And Friends",
        "description":  "Hanselman and Friends",
        "id":  "keynotehanselmanandfriends",
        "endTime":  "2017-05-24T20:00:00Z",
        "room":  "Swan 5 - 10",
        "startTime":  "2017-05-24T19:00:00Z"
    },
    {
        "speakers":  "Bob Ward, Kimberly Tripp, Paul Randal, Richard Campbell",
        "track":  "sql",
        "title":  "Sqlintersection Closing Panel \u0026 Runas Radio Recording",
        "description":  "Hosted by Richard Cambpell of RunAs Radio and featureing Bob Ward, Paul S. Randal and Kimberly L. Tripp with cameos fro other SQLintersection speakers",
        "id":  "sqlintersectionclosingpanelrunasradiorecording",
        "endTime":  "2017-05-24T20:00:00Z",
        "room":  "Swan 2 - 3",
        "startTime":  "2017-05-24T19:00:00Z"
    },
    {
        "speakers":  "Carl Franklin, Richard Campbell",
        "track":  "it",
        "title":  "Closing \u0026 Prizes",
        "description":  "",
        "id":  "closingprizes",
        "endTime":  "2017-05-24T21:00:00Z",
        "room":  "Swan Ballroom",
        "startTime":  "2017-05-24T20:15:00Z"
    }
]
